package com.twitter.teruteru128.study.tt;

/**
 * <pre>
 *あいうえおＡＢＣＤＥ
 *かきくけこＦＧＨＩＪ
 *さしすせそＫＬＭＮＯ
 *たちつてとＰＱＲＳＴ
 *なにぬねのＵＶＷＸＹ
 *はひふへほＺ？！－／
 *まみむめも￥＆　　　
 *や（ゆ）よ＊＃　　　
 *らりるれろ１２３４５
 *わをん゛゜６７８９０
 * </pre>
 */
public class TwoTouch {
    private static final char[][] map = {
            { '０', 'わ', 'を', 'ん', '゛', '゜', '６', '７', '８', '９' },
            { 'Ｅ', 'あ', 'い', 'う', 'え', 'お', 'Ａ', 'Ｂ', 'Ｃ', 'Ｄ' },
            { 'Ｊ', 'か', 'き', 'く', 'け', 'こ', 'Ｆ', 'Ｇ', 'Ｈ', 'Ｉ' },
            { 'Ｏ', 'さ', 'し', 'す', 'せ', 'そ', 'Ｋ', 'Ｌ', 'Ｍ', 'Ｎ' },
            { 'Ｔ', 'た', 'ち', 'つ', 'て', 'と', 'Ｐ', 'Ｑ', 'Ｒ', 'Ｓ' },
            { 'Ｙ', 'な', 'に', 'ぬ', 'ね', 'の', 'Ｕ', 'Ｖ', 'Ｗ', 'Ｘ' },
            { '／', 'は', 'ひ', 'ふ', 'へ', 'ほ', 'Ｚ', '？', '！', '－' },
            { '　', 'ま', 'み', 'む', 'め', 'も', '￥', '＆', '　', '　' },
            { '　', 'や', '（', 'ゆ', '）', 'よ', '＊', '＃', '　', '　' },
            { '５', 'ら', 'り', 'る', 'れ', 'ろ', '１', '２', '３', '４' },
    };

    private TwoTouch() {
    }

    public static char get(int first, int second) {
        if ((first < 0) || (10 < first) || (second < 0) || (10 < second)) {
            throw new IllegalArgumentException();
        }
        return map[first][second];
    }
}
