// Generated by jextract

package com.github.teruteru128.foreign.opencl;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * union {
 *     cl_int s[16];
 *     struct {
 *         cl_int x;
 *         cl_int y;
 *         cl_int z;
 *         cl_int w;
 *         cl_int __spacer4;
 *         cl_int __spacer5;
 *         cl_int __spacer6;
 *         cl_int __spacer7;
 *         cl_int __spacer8;
 *         cl_int __spacer9;
 *         cl_int sa;
 *         cl_int sb;
 *         cl_int sc;
 *         cl_int sd;
 *         cl_int se;
 *         cl_int sf;
 *     };
 *     struct {
 *         cl_int s0;
 *         cl_int s1;
 *         cl_int s2;
 *         cl_int s3;
 *         cl_int s4;
 *         cl_int s5;
 *         cl_int s6;
 *         cl_int s7;
 *         cl_int s8;
 *         cl_int s9;
 *         cl_int sA;
 *         cl_int sB;
 *         cl_int sC;
 *         cl_int sD;
 *         cl_int sE;
 *         cl_int sF;
 *     };
 *     struct {
 *         cl_int8 lo;
 *         cl_int8 hi;
 *     };
 *     __cl_int2 v2[8];
 *     __cl_int4 v4[4];
 * }
 * }
 */
public class cl_int16 {

    cl_int16() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
        MemoryLayout.sequenceLayout(16, opencl_h.C_INT).withName("s"),
        MemoryLayout.structLayout(
            opencl_h.C_INT.withName("x"),
            opencl_h.C_INT.withName("y"),
            opencl_h.C_INT.withName("z"),
            opencl_h.C_INT.withName("w"),
            opencl_h.C_INT.withName("__spacer4"),
            opencl_h.C_INT.withName("__spacer5"),
            opencl_h.C_INT.withName("__spacer6"),
            opencl_h.C_INT.withName("__spacer7"),
            opencl_h.C_INT.withName("__spacer8"),
            opencl_h.C_INT.withName("__spacer9"),
            opencl_h.C_INT.withName("sa"),
            opencl_h.C_INT.withName("sb"),
            opencl_h.C_INT.withName("sc"),
            opencl_h.C_INT.withName("sd"),
            opencl_h.C_INT.withName("se"),
            opencl_h.C_INT.withName("sf")
        ).withName("$anon$987:23"),
        MemoryLayout.structLayout(
            opencl_h.C_INT.withName("s0"),
            opencl_h.C_INT.withName("s1"),
            opencl_h.C_INT.withName("s2"),
            opencl_h.C_INT.withName("s3"),
            opencl_h.C_INT.withName("s4"),
            opencl_h.C_INT.withName("s5"),
            opencl_h.C_INT.withName("s6"),
            opencl_h.C_INT.withName("s7"),
            opencl_h.C_INT.withName("s8"),
            opencl_h.C_INT.withName("s9"),
            opencl_h.C_INT.withName("sA"),
            opencl_h.C_INT.withName("sB"),
            opencl_h.C_INT.withName("sC"),
            opencl_h.C_INT.withName("sD"),
            opencl_h.C_INT.withName("sE"),
            opencl_h.C_INT.withName("sF")
        ).withName("$anon$988:23"),
        MemoryLayout.structLayout(
            cl_int8.layout().withName("lo"),
            cl_int8.layout().withName("hi")
        ).withName("$anon$989:23"),
        MemoryLayout.sequenceLayout(8, MemoryLayout.sequenceLayout(1, opencl_h.C_LONG_LONG)).withName("v2"),
        MemoryLayout.sequenceLayout(4, MemoryLayout.sequenceLayout(2, opencl_h.C_LONG_LONG)).withName("v4")
    ).withName("$anon$983:9");

    /**
     * The layout of this union
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final SequenceLayout s$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("s"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int s[16]
     * }
     */
    public static final SequenceLayout s$layout() {
        return s$LAYOUT;
    }

    private static final long s$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int s[16]
     * }
     */
    public static final long s$offset() {
        return s$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int s[16]
     * }
     */
    public static MemorySegment s(MemorySegment union) {
        return union.asSlice(s$OFFSET, s$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int s[16]
     * }
     */
    public static void s(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, s$OFFSET, s$LAYOUT.byteSize());
    }

    private static long[] s$DIMS = { 16 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * cl_int s[16]
     * }
     */
    public static long[] s$dimensions() {
        return s$DIMS;
    }
    private static final VarHandle s$ELEM_HANDLE = s$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * cl_int s[16]
     * }
     */
    public static int s(MemorySegment union, long index0) {
        return (int)s$ELEM_HANDLE.get(union, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * cl_int s[16]
     * }
     */
    public static void s(MemorySegment union, long index0, int fieldValue) {
        s$ELEM_HANDLE.set(union, 0L, index0, fieldValue);
    }

    private static final OfInt x$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("x"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int x
     * }
     */
    public static final OfInt x$layout() {
        return x$LAYOUT;
    }

    private static final long x$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int x
     * }
     */
    public static final long x$offset() {
        return x$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int x
     * }
     */
    public static int x(MemorySegment union) {
        return union.get(x$LAYOUT, x$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int x
     * }
     */
    public static void x(MemorySegment union, int fieldValue) {
        union.set(x$LAYOUT, x$OFFSET, fieldValue);
    }

    private static final OfInt y$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("y"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int y
     * }
     */
    public static final OfInt y$layout() {
        return y$LAYOUT;
    }

    private static final long y$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int y
     * }
     */
    public static final long y$offset() {
        return y$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int y
     * }
     */
    public static int y(MemorySegment union) {
        return union.get(y$LAYOUT, y$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int y
     * }
     */
    public static void y(MemorySegment union, int fieldValue) {
        union.set(y$LAYOUT, y$OFFSET, fieldValue);
    }

    private static final OfInt z$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("z"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int z
     * }
     */
    public static final OfInt z$layout() {
        return z$LAYOUT;
    }

    private static final long z$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int z
     * }
     */
    public static final long z$offset() {
        return z$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int z
     * }
     */
    public static int z(MemorySegment union) {
        return union.get(z$LAYOUT, z$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int z
     * }
     */
    public static void z(MemorySegment union, int fieldValue) {
        union.set(z$LAYOUT, z$OFFSET, fieldValue);
    }

    private static final OfInt w$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("w"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int w
     * }
     */
    public static final OfInt w$layout() {
        return w$LAYOUT;
    }

    private static final long w$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int w
     * }
     */
    public static final long w$offset() {
        return w$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int w
     * }
     */
    public static int w(MemorySegment union) {
        return union.get(w$LAYOUT, w$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int w
     * }
     */
    public static void w(MemorySegment union, int fieldValue) {
        union.set(w$LAYOUT, w$OFFSET, fieldValue);
    }

    private static final OfInt __spacer4$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("__spacer4"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int __spacer4
     * }
     */
    public static final OfInt __spacer4$layout() {
        return __spacer4$LAYOUT;
    }

    private static final long __spacer4$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int __spacer4
     * }
     */
    public static final long __spacer4$offset() {
        return __spacer4$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int __spacer4
     * }
     */
    public static int __spacer4(MemorySegment union) {
        return union.get(__spacer4$LAYOUT, __spacer4$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int __spacer4
     * }
     */
    public static void __spacer4(MemorySegment union, int fieldValue) {
        union.set(__spacer4$LAYOUT, __spacer4$OFFSET, fieldValue);
    }

    private static final OfInt __spacer5$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("__spacer5"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int __spacer5
     * }
     */
    public static final OfInt __spacer5$layout() {
        return __spacer5$LAYOUT;
    }

    private static final long __spacer5$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int __spacer5
     * }
     */
    public static final long __spacer5$offset() {
        return __spacer5$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int __spacer5
     * }
     */
    public static int __spacer5(MemorySegment union) {
        return union.get(__spacer5$LAYOUT, __spacer5$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int __spacer5
     * }
     */
    public static void __spacer5(MemorySegment union, int fieldValue) {
        union.set(__spacer5$LAYOUT, __spacer5$OFFSET, fieldValue);
    }

    private static final OfInt __spacer6$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("__spacer6"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int __spacer6
     * }
     */
    public static final OfInt __spacer6$layout() {
        return __spacer6$LAYOUT;
    }

    private static final long __spacer6$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int __spacer6
     * }
     */
    public static final long __spacer6$offset() {
        return __spacer6$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int __spacer6
     * }
     */
    public static int __spacer6(MemorySegment union) {
        return union.get(__spacer6$LAYOUT, __spacer6$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int __spacer6
     * }
     */
    public static void __spacer6(MemorySegment union, int fieldValue) {
        union.set(__spacer6$LAYOUT, __spacer6$OFFSET, fieldValue);
    }

    private static final OfInt __spacer7$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("__spacer7"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int __spacer7
     * }
     */
    public static final OfInt __spacer7$layout() {
        return __spacer7$LAYOUT;
    }

    private static final long __spacer7$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int __spacer7
     * }
     */
    public static final long __spacer7$offset() {
        return __spacer7$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int __spacer7
     * }
     */
    public static int __spacer7(MemorySegment union) {
        return union.get(__spacer7$LAYOUT, __spacer7$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int __spacer7
     * }
     */
    public static void __spacer7(MemorySegment union, int fieldValue) {
        union.set(__spacer7$LAYOUT, __spacer7$OFFSET, fieldValue);
    }

    private static final OfInt __spacer8$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("__spacer8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int __spacer8
     * }
     */
    public static final OfInt __spacer8$layout() {
        return __spacer8$LAYOUT;
    }

    private static final long __spacer8$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int __spacer8
     * }
     */
    public static final long __spacer8$offset() {
        return __spacer8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int __spacer8
     * }
     */
    public static int __spacer8(MemorySegment union) {
        return union.get(__spacer8$LAYOUT, __spacer8$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int __spacer8
     * }
     */
    public static void __spacer8(MemorySegment union, int fieldValue) {
        union.set(__spacer8$LAYOUT, __spacer8$OFFSET, fieldValue);
    }

    private static final OfInt __spacer9$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("__spacer9"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int __spacer9
     * }
     */
    public static final OfInt __spacer9$layout() {
        return __spacer9$LAYOUT;
    }

    private static final long __spacer9$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int __spacer9
     * }
     */
    public static final long __spacer9$offset() {
        return __spacer9$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int __spacer9
     * }
     */
    public static int __spacer9(MemorySegment union) {
        return union.get(__spacer9$LAYOUT, __spacer9$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int __spacer9
     * }
     */
    public static void __spacer9(MemorySegment union, int fieldValue) {
        union.set(__spacer9$LAYOUT, __spacer9$OFFSET, fieldValue);
    }

    private static final OfInt sa$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("sa"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int sa
     * }
     */
    public static final OfInt sa$layout() {
        return sa$LAYOUT;
    }

    private static final long sa$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int sa
     * }
     */
    public static final long sa$offset() {
        return sa$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int sa
     * }
     */
    public static int sa(MemorySegment union) {
        return union.get(sa$LAYOUT, sa$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int sa
     * }
     */
    public static void sa(MemorySegment union, int fieldValue) {
        union.set(sa$LAYOUT, sa$OFFSET, fieldValue);
    }

    private static final OfInt sb$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("sb"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int sb
     * }
     */
    public static final OfInt sb$layout() {
        return sb$LAYOUT;
    }

    private static final long sb$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int sb
     * }
     */
    public static final long sb$offset() {
        return sb$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int sb
     * }
     */
    public static int sb(MemorySegment union) {
        return union.get(sb$LAYOUT, sb$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int sb
     * }
     */
    public static void sb(MemorySegment union, int fieldValue) {
        union.set(sb$LAYOUT, sb$OFFSET, fieldValue);
    }

    private static final OfInt sc$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("sc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int sc
     * }
     */
    public static final OfInt sc$layout() {
        return sc$LAYOUT;
    }

    private static final long sc$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int sc
     * }
     */
    public static final long sc$offset() {
        return sc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int sc
     * }
     */
    public static int sc(MemorySegment union) {
        return union.get(sc$LAYOUT, sc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int sc
     * }
     */
    public static void sc(MemorySegment union, int fieldValue) {
        union.set(sc$LAYOUT, sc$OFFSET, fieldValue);
    }

    private static final OfInt sd$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("sd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int sd
     * }
     */
    public static final OfInt sd$layout() {
        return sd$LAYOUT;
    }

    private static final long sd$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int sd
     * }
     */
    public static final long sd$offset() {
        return sd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int sd
     * }
     */
    public static int sd(MemorySegment union) {
        return union.get(sd$LAYOUT, sd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int sd
     * }
     */
    public static void sd(MemorySegment union, int fieldValue) {
        union.set(sd$LAYOUT, sd$OFFSET, fieldValue);
    }

    private static final OfInt se$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("se"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int se
     * }
     */
    public static final OfInt se$layout() {
        return se$LAYOUT;
    }

    private static final long se$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int se
     * }
     */
    public static final long se$offset() {
        return se$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int se
     * }
     */
    public static int se(MemorySegment union) {
        return union.get(se$LAYOUT, se$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int se
     * }
     */
    public static void se(MemorySegment union, int fieldValue) {
        union.set(se$LAYOUT, se$OFFSET, fieldValue);
    }

    private static final OfInt sf$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$987:23"), groupElement("sf"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int sf
     * }
     */
    public static final OfInt sf$layout() {
        return sf$LAYOUT;
    }

    private static final long sf$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int sf
     * }
     */
    public static final long sf$offset() {
        return sf$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int sf
     * }
     */
    public static int sf(MemorySegment union) {
        return union.get(sf$LAYOUT, sf$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int sf
     * }
     */
    public static void sf(MemorySegment union, int fieldValue) {
        union.set(sf$LAYOUT, sf$OFFSET, fieldValue);
    }

    private static final OfInt s0$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("s0"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int s0
     * }
     */
    public static final OfInt s0$layout() {
        return s0$LAYOUT;
    }

    private static final long s0$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int s0
     * }
     */
    public static final long s0$offset() {
        return s0$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int s0
     * }
     */
    public static int s0(MemorySegment union) {
        return union.get(s0$LAYOUT, s0$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int s0
     * }
     */
    public static void s0(MemorySegment union, int fieldValue) {
        union.set(s0$LAYOUT, s0$OFFSET, fieldValue);
    }

    private static final OfInt s1$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("s1"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int s1
     * }
     */
    public static final OfInt s1$layout() {
        return s1$LAYOUT;
    }

    private static final long s1$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int s1
     * }
     */
    public static final long s1$offset() {
        return s1$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int s1
     * }
     */
    public static int s1(MemorySegment union) {
        return union.get(s1$LAYOUT, s1$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int s1
     * }
     */
    public static void s1(MemorySegment union, int fieldValue) {
        union.set(s1$LAYOUT, s1$OFFSET, fieldValue);
    }

    private static final OfInt s2$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("s2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int s2
     * }
     */
    public static final OfInt s2$layout() {
        return s2$LAYOUT;
    }

    private static final long s2$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int s2
     * }
     */
    public static final long s2$offset() {
        return s2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int s2
     * }
     */
    public static int s2(MemorySegment union) {
        return union.get(s2$LAYOUT, s2$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int s2
     * }
     */
    public static void s2(MemorySegment union, int fieldValue) {
        union.set(s2$LAYOUT, s2$OFFSET, fieldValue);
    }

    private static final OfInt s3$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("s3"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int s3
     * }
     */
    public static final OfInt s3$layout() {
        return s3$LAYOUT;
    }

    private static final long s3$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int s3
     * }
     */
    public static final long s3$offset() {
        return s3$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int s3
     * }
     */
    public static int s3(MemorySegment union) {
        return union.get(s3$LAYOUT, s3$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int s3
     * }
     */
    public static void s3(MemorySegment union, int fieldValue) {
        union.set(s3$LAYOUT, s3$OFFSET, fieldValue);
    }

    private static final OfInt s4$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("s4"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int s4
     * }
     */
    public static final OfInt s4$layout() {
        return s4$LAYOUT;
    }

    private static final long s4$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int s4
     * }
     */
    public static final long s4$offset() {
        return s4$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int s4
     * }
     */
    public static int s4(MemorySegment union) {
        return union.get(s4$LAYOUT, s4$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int s4
     * }
     */
    public static void s4(MemorySegment union, int fieldValue) {
        union.set(s4$LAYOUT, s4$OFFSET, fieldValue);
    }

    private static final OfInt s5$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("s5"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int s5
     * }
     */
    public static final OfInt s5$layout() {
        return s5$LAYOUT;
    }

    private static final long s5$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int s5
     * }
     */
    public static final long s5$offset() {
        return s5$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int s5
     * }
     */
    public static int s5(MemorySegment union) {
        return union.get(s5$LAYOUT, s5$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int s5
     * }
     */
    public static void s5(MemorySegment union, int fieldValue) {
        union.set(s5$LAYOUT, s5$OFFSET, fieldValue);
    }

    private static final OfInt s6$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("s6"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int s6
     * }
     */
    public static final OfInt s6$layout() {
        return s6$LAYOUT;
    }

    private static final long s6$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int s6
     * }
     */
    public static final long s6$offset() {
        return s6$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int s6
     * }
     */
    public static int s6(MemorySegment union) {
        return union.get(s6$LAYOUT, s6$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int s6
     * }
     */
    public static void s6(MemorySegment union, int fieldValue) {
        union.set(s6$LAYOUT, s6$OFFSET, fieldValue);
    }

    private static final OfInt s7$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("s7"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int s7
     * }
     */
    public static final OfInt s7$layout() {
        return s7$LAYOUT;
    }

    private static final long s7$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int s7
     * }
     */
    public static final long s7$offset() {
        return s7$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int s7
     * }
     */
    public static int s7(MemorySegment union) {
        return union.get(s7$LAYOUT, s7$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int s7
     * }
     */
    public static void s7(MemorySegment union, int fieldValue) {
        union.set(s7$LAYOUT, s7$OFFSET, fieldValue);
    }

    private static final OfInt s8$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("s8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int s8
     * }
     */
    public static final OfInt s8$layout() {
        return s8$LAYOUT;
    }

    private static final long s8$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int s8
     * }
     */
    public static final long s8$offset() {
        return s8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int s8
     * }
     */
    public static int s8(MemorySegment union) {
        return union.get(s8$LAYOUT, s8$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int s8
     * }
     */
    public static void s8(MemorySegment union, int fieldValue) {
        union.set(s8$LAYOUT, s8$OFFSET, fieldValue);
    }

    private static final OfInt s9$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("s9"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int s9
     * }
     */
    public static final OfInt s9$layout() {
        return s9$LAYOUT;
    }

    private static final long s9$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int s9
     * }
     */
    public static final long s9$offset() {
        return s9$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int s9
     * }
     */
    public static int s9(MemorySegment union) {
        return union.get(s9$LAYOUT, s9$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int s9
     * }
     */
    public static void s9(MemorySegment union, int fieldValue) {
        union.set(s9$LAYOUT, s9$OFFSET, fieldValue);
    }

    private static final OfInt sA$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("sA"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int sA
     * }
     */
    public static final OfInt sA$layout() {
        return sA$LAYOUT;
    }

    private static final long sA$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int sA
     * }
     */
    public static final long sA$offset() {
        return sA$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int sA
     * }
     */
    public static int sA(MemorySegment union) {
        return union.get(sA$LAYOUT, sA$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int sA
     * }
     */
    public static void sA(MemorySegment union, int fieldValue) {
        union.set(sA$LAYOUT, sA$OFFSET, fieldValue);
    }

    private static final OfInt sB$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("sB"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int sB
     * }
     */
    public static final OfInt sB$layout() {
        return sB$LAYOUT;
    }

    private static final long sB$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int sB
     * }
     */
    public static final long sB$offset() {
        return sB$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int sB
     * }
     */
    public static int sB(MemorySegment union) {
        return union.get(sB$LAYOUT, sB$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int sB
     * }
     */
    public static void sB(MemorySegment union, int fieldValue) {
        union.set(sB$LAYOUT, sB$OFFSET, fieldValue);
    }

    private static final OfInt sC$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("sC"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int sC
     * }
     */
    public static final OfInt sC$layout() {
        return sC$LAYOUT;
    }

    private static final long sC$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int sC
     * }
     */
    public static final long sC$offset() {
        return sC$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int sC
     * }
     */
    public static int sC(MemorySegment union) {
        return union.get(sC$LAYOUT, sC$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int sC
     * }
     */
    public static void sC(MemorySegment union, int fieldValue) {
        union.set(sC$LAYOUT, sC$OFFSET, fieldValue);
    }

    private static final OfInt sD$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("sD"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int sD
     * }
     */
    public static final OfInt sD$layout() {
        return sD$LAYOUT;
    }

    private static final long sD$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int sD
     * }
     */
    public static final long sD$offset() {
        return sD$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int sD
     * }
     */
    public static int sD(MemorySegment union) {
        return union.get(sD$LAYOUT, sD$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int sD
     * }
     */
    public static void sD(MemorySegment union, int fieldValue) {
        union.set(sD$LAYOUT, sD$OFFSET, fieldValue);
    }

    private static final OfInt sE$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("sE"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int sE
     * }
     */
    public static final OfInt sE$layout() {
        return sE$LAYOUT;
    }

    private static final long sE$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int sE
     * }
     */
    public static final long sE$offset() {
        return sE$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int sE
     * }
     */
    public static int sE(MemorySegment union) {
        return union.get(sE$LAYOUT, sE$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int sE
     * }
     */
    public static void sE(MemorySegment union, int fieldValue) {
        union.set(sE$LAYOUT, sE$OFFSET, fieldValue);
    }

    private static final OfInt sF$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$988:23"), groupElement("sF"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int sF
     * }
     */
    public static final OfInt sF$layout() {
        return sF$LAYOUT;
    }

    private static final long sF$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int sF
     * }
     */
    public static final long sF$offset() {
        return sF$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int sF
     * }
     */
    public static int sF(MemorySegment union) {
        return union.get(sF$LAYOUT, sF$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int sF
     * }
     */
    public static void sF(MemorySegment union, int fieldValue) {
        union.set(sF$LAYOUT, sF$OFFSET, fieldValue);
    }

    private static final GroupLayout lo$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$989:23"), groupElement("lo"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int8 lo
     * }
     */
    public static final GroupLayout lo$layout() {
        return lo$LAYOUT;
    }

    private static final long lo$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int8 lo
     * }
     */
    public static final long lo$offset() {
        return lo$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int8 lo
     * }
     */
    public static MemorySegment lo(MemorySegment union) {
        return union.asSlice(lo$OFFSET, lo$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int8 lo
     * }
     */
    public static void lo(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, lo$OFFSET, lo$LAYOUT.byteSize());
    }

    private static final GroupLayout hi$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$989:23"), groupElement("hi"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_int8 hi
     * }
     */
    public static final GroupLayout hi$layout() {
        return hi$LAYOUT;
    }

    private static final long hi$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_int8 hi
     * }
     */
    public static final long hi$offset() {
        return hi$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_int8 hi
     * }
     */
    public static MemorySegment hi(MemorySegment union) {
        return union.asSlice(hi$OFFSET, hi$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_int8 hi
     * }
     */
    public static void hi(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, hi$OFFSET, hi$LAYOUT.byteSize());
    }

    private static final SequenceLayout v2$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("v2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __cl_int2 v2[8]
     * }
     */
    public static final SequenceLayout v2$layout() {
        return v2$LAYOUT;
    }

    private static final long v2$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __cl_int2 v2[8]
     * }
     */
    public static final long v2$offset() {
        return v2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __cl_int2 v2[8]
     * }
     */
    public static MemorySegment v2(MemorySegment union) {
        return union.asSlice(v2$OFFSET, v2$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __cl_int2 v2[8]
     * }
     */
    public static void v2(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, v2$OFFSET, v2$LAYOUT.byteSize());
    }

    private static long[] v2$DIMS = { 8 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __cl_int2 v2[8]
     * }
     */
    public static long[] v2$dimensions() {
        return v2$DIMS;
    }
    private static final VarHandle v2$ELEM_HANDLE = v2$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __cl_int2 v2[8]
     * }
     */
    public static MemorySegment v2(MemorySegment union, long index0) {
        return (MemorySegment)v2$ELEM_HANDLE.get(union, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __cl_int2 v2[8]
     * }
     */
    public static void v2(MemorySegment union, long index0, MemorySegment fieldValue) {
        v2$ELEM_HANDLE.set(union, 0L, index0, fieldValue);
    }

    private static final SequenceLayout v4$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("v4"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __cl_int4 v4[4]
     * }
     */
    public static final SequenceLayout v4$layout() {
        return v4$LAYOUT;
    }

    private static final long v4$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __cl_int4 v4[4]
     * }
     */
    public static final long v4$offset() {
        return v4$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __cl_int4 v4[4]
     * }
     */
    public static MemorySegment v4(MemorySegment union) {
        return union.asSlice(v4$OFFSET, v4$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __cl_int4 v4[4]
     * }
     */
    public static void v4(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, v4$OFFSET, v4$LAYOUT.byteSize());
    }

    private static long[] v4$DIMS = { 4 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __cl_int4 v4[4]
     * }
     */
    public static long[] v4$dimensions() {
        return v4$DIMS;
    }
    private static final VarHandle v4$ELEM_HANDLE = v4$LAYOUT.varHandle(sequenceElement());

