// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2013 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2013() {}
    static final VarHandle const$0 = constants$2012.const$3.varHandle(MemoryLayout.PathElement.groupElement("rgExtension"));
    static final StructLayout const$1 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("SerialNumber"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwLowDateTime"),
            JAVA_INT.withName("dwHighDateTime")
        ).withName("RevocationDate"),
        JAVA_INT.withName("cExtension"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgExtension")
    ).withName("_CRL_ENTRY");
    static final VarHandle const$2 = constants$2013.const$1.varHandle(MemoryLayout.PathElement.groupElement("cExtension"));
    static final VarHandle const$3 = constants$2013.const$1.varHandle(MemoryLayout.PathElement.groupElement("rgExtension"));
    static final StructLayout const$4 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwVersion"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("SignatureAlgorithm"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("Issuer"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwLowDateTime"),
            JAVA_INT.withName("dwHighDateTime")
        ).withName("ThisUpdate"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwLowDateTime"),
            JAVA_INT.withName("dwHighDateTime")
        ).withName("NextUpdate"),
        JAVA_INT.withName("cCRLEntry"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgCRLEntry"),
        JAVA_INT.withName("cExtension"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgExtension")
    ).withName("_CRL_INFO");
    static final VarHandle const$5 = constants$2013.const$4.varHandle(MemoryLayout.PathElement.groupElement("dwVersion"));
}


