// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2214 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2214() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwType"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cUsageIdentifier"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("rgpszUsageIdentifier")
        ).withName("Usage")
    ).withName("_CTL_USAGE_MATCH");
    static final VarHandle const$1 = constants$2214.const$0.varHandle(MemoryLayout.PathElement.groupElement("dwType"));
    static final StructLayout const$2 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwType"),
            MemoryLayout.paddingLayout(4),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cUsageIdentifier"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("rgpszUsageIdentifier")
            ).withName("Usage")
        ).withName("RequestedUsage")
    ).withName("_CERT_CHAIN_PARA");
    static final VarHandle const$3 = constants$2214.const$2.varHandle(MemoryLayout.PathElement.groupElement("cbSize"));
    static final FunctionDescriptor const$4 = FunctionDescriptor.of(JAVA_INT,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        JAVA_INT,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER
    );
    static final MethodHandle const$5 = RuntimeHelper.downcallHandle(
        "CertGetCertificateChain",
        constants$2214.const$4
    );
}


