// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2143 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2143() {}
    static final MethodHandle const$0 = RuntimeHelper.downcallHandle(
        "CertEnumCTLsInStore",
        constants$30.const$3
    );
    static final FunctionDescriptor const$1 = FunctionDescriptor.of(RuntimeHelper.POINTER,
        JAVA_INT,
        JAVA_INT,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        JAVA_INT
    );
    static final MethodHandle const$2 = RuntimeHelper.downcallHandle(
        "CertFindSubjectInCTL",
        constants$2143.const$1
    );
    static final StructLayout const$3 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("SubjectAlgorithm"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("SubjectIdentifier")
    ).withName("_CTL_ANY_SUBJECT_INFO");
    static final MethodHandle const$4 = RuntimeHelper.downcallHandle(
        "CertFindCTLInStore",
        constants$2136.const$0
    );
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cUsageIdentifier"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("rgpszUsageIdentifier")
        ).withName("SubjectUsage"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("ListIdentifier"),
        RuntimeHelper.POINTER.withName("pSigner")
    ).withName("_CTL_FIND_USAGE_PARA");
}


