// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2015 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2015() {}
    static final VarHandle const$0 = constants$2014.const$4.varHandle(MemoryLayout.PathElement.groupElement("cbEncoded"));
    static final VarHandle const$1 = constants$2014.const$4.varHandle(MemoryLayout.PathElement.groupElement("pbEncoded"));
    static final StructLayout const$2 = MemoryLayout.structLayout(
        JAVA_INT.withName("cItem"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgItem")
    ).withName("_CERT_OR_CRL_BUNDLE");
    static final VarHandle const$3 = constants$2015.const$2.varHandle(MemoryLayout.PathElement.groupElement("cItem"));
    static final VarHandle const$4 = constants$2015.const$2.varHandle(MemoryLayout.PathElement.groupElement("rgItem"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwVersion"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("Subject"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                RuntimeHelper.POINTER.withName("pszObjId"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData")
                ).withName("Parameters")
            ).withName("Algorithm"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData"),
                JAVA_INT.withName("cUnusedBits"),
                MemoryLayout.paddingLayout(4)
            ).withName("PublicKey")
        ).withName("SubjectPublicKeyInfo"),
        JAVA_INT.withName("cAttribute"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgAttribute")
    ).withName("_CERT_REQUEST_INFO");
}


