// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2043 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2043() {}
    static final VarHandle const$0 = constants$2042.const$5.varHandle(MemoryLayout.PathElement.groupElement("pgenCounter"));
    static final StructLayout const$1 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("p"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("g"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("q"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("j"),
        RuntimeHelper.POINTER.withName("pValidationParams")
    ).withName("_CERT_X942_DH_PARAMETERS");
    static final VarHandle const$2 = constants$2043.const$1.varHandle(MemoryLayout.PathElement.groupElement("pValidationParams"));
    static final StructLayout const$3 = MemoryLayout.structLayout(
        RuntimeHelper.POINTER.withName("pszContentEncryptionObjId"),
        MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("rgbCounter"),
        MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("rgbKeyLength"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("PubInfo")
    ).withName("_CRYPT_X942_OTHER_INFO");
    static final VarHandle const$4 = constants$2043.const$3.varHandle(MemoryLayout.PathElement.groupElement("pszContentEncryptionObjId"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("Algorithm"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("EntityUInfo"),
        MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("rgbSuppPubInfo"),
        MemoryLayout.paddingLayout(4)
    ).withName("_CRYPT_ECC_CMS_SHARED_INFO");
}


