// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2069 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2069() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                RuntimeHelper.POINTER.withName("pszObjId"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData")
                ).withName("Parameters")
            ).withName("HashAlgorithm"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("IssuerNameHash"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("IssuerKeyHash"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("SerialNumber")
        ).withName("CertId"),
        JAVA_INT.withName("dwCertStatus"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.unionLayout(
            RuntimeHelper.POINTER.withName("pRevokedInfo")
        ).withName("$anon$0"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwLowDateTime"),
            JAVA_INT.withName("dwHighDateTime")
        ).withName("ThisUpdate"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwLowDateTime"),
            JAVA_INT.withName("dwHighDateTime")
        ).withName("NextUpdate"),
        JAVA_INT.withName("cExtension"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgExtension")
    ).withName("_OCSP_BASIC_RESPONSE_ENTRY");
    static final VarHandle const$1 = constants$2069.const$0.varHandle(MemoryLayout.PathElement.groupElement("dwCertStatus"));
    static final VarHandle const$2 = constants$2069.const$0.varHandle(MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("pRevokedInfo"));
    static final VarHandle const$3 = constants$2069.const$0.varHandle(MemoryLayout.PathElement.groupElement("cExtension"));
    static final VarHandle const$4 = constants$2069.const$0.varHandle(MemoryLayout.PathElement.groupElement("rgExtension"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwVersion"),
        JAVA_INT.withName("dwResponderIdChoice"),
        MemoryLayout.unionLayout(
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("ByNameResponderId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("ByKeyResponderId")
        ).withName("$anon$0"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwLowDateTime"),
            JAVA_INT.withName("dwHighDateTime")
        ).withName("ProducedAt"),
        JAVA_INT.withName("cResponseEntry"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgResponseEntry"),
        JAVA_INT.withName("cExtension"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgExtension")
    ).withName("_OCSP_BASIC_RESPONSE_INFO");
}


