// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$3435 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$3435() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            MemoryLayout.unionLayout(
                RuntimeHelper.POINTER.withName("lptdesc"),
                RuntimeHelper.POINTER.withName("lpadesc"),
                JAVA_INT.withName("hreftype")
            ).withName("$anon$0"),
            JAVA_SHORT.withName("vt"),
            MemoryLayout.paddingLayout(6)
        ).withName("tdesc"),
        MemoryLayout.unionLayout(
            MemoryLayout.structLayout(
                JAVA_LONG.withName("dwReserved"),
                JAVA_SHORT.withName("wIDLFlags"),
                MemoryLayout.paddingLayout(6)
            ).withName("idldesc"),
            MemoryLayout.structLayout(
                RuntimeHelper.POINTER.withName("pparamdescex"),
                JAVA_SHORT.withName("wParamFlags"),
                MemoryLayout.paddingLayout(6)
            ).withName("paramdesc")
        ).withName("$anon$0")
    ).withName("tagELEMDESC");
    static final StructLayout const$1 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("Data1"),
            JAVA_SHORT.withName("Data2"),
            JAVA_SHORT.withName("Data3"),
            MemoryLayout.sequenceLayout(8, JAVA_BYTE).withName("Data4")
        ).withName("guid"),
        JAVA_INT.withName("lcid"),
        JAVA_INT.withName("dwReserved"),
        JAVA_INT.withName("memidConstructor"),
        JAVA_INT.withName("memidDestructor"),
        RuntimeHelper.POINTER.withName("lpstrSchema"),
        JAVA_INT.withName("cbSizeInstance"),
        JAVA_INT.withName("typekind"),
        JAVA_SHORT.withName("cFuncs"),
        JAVA_SHORT.withName("cVars"),
        JAVA_SHORT.withName("cImplTypes"),
        JAVA_SHORT.withName("cbSizeVft"),
        JAVA_SHORT.withName("cbAlignment"),
        JAVA_SHORT.withName("wTypeFlags"),
        JAVA_SHORT.withName("wMajorVerNum"),
        JAVA_SHORT.withName("wMinorVerNum"),
        MemoryLayout.structLayout(
            MemoryLayout.unionLayout(
                RuntimeHelper.POINTER.withName("lptdesc"),
                RuntimeHelper.POINTER.withName("lpadesc"),
                JAVA_INT.withName("hreftype")
            ).withName("$anon$0"),
            JAVA_SHORT.withName("vt"),
            MemoryLayout.paddingLayout(6)
        ).withName("tdescAlias"),
        MemoryLayout.structLayout(
            JAVA_LONG.withName("dwReserved"),
            JAVA_SHORT.withName("wIDLFlags"),
            MemoryLayout.paddingLayout(6)
        ).withName("idldescType")
    ).withName("tagTYPEATTR");
    static final VarHandle const$2 = constants$3435.const$1.varHandle(MemoryLayout.PathElement.groupElement("lcid"));
    static final VarHandle const$3 = constants$3435.const$1.varHandle(MemoryLayout.PathElement.groupElement("dwReserved"));
    static final VarHandle const$4 = constants$3435.const$1.varHandle(MemoryLayout.PathElement.groupElement("memidConstructor"));
    static final VarHandle const$5 = constants$3435.const$1.varHandle(MemoryLayout.PathElement.groupElement("memidDestructor"));
}


