// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2112 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2112() {}
    static final VarHandle const$0 = constants$2111.const$3.varHandle(MemoryLayout.PathElement.groupElement("dwFlags"));
    static final MethodHandle const$1 = RuntimeHelper.upcallHandle(PFN_CMSG_EXPORT_KEY_TRANS.class, "apply", constants$691.const$2);
    static final MethodHandle const$2 = RuntimeHelper.downcallHandle(
        constants$691.const$2
    );
    static final StructLayout const$3 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("EncryptedKey")
    ).withName("_CMSG_KEY_AGREE_KEY_ENCRYPT_INFO");
    static final VarHandle const$4 = constants$2112.const$3.varHandle(MemoryLayout.PathElement.groupElement("cbSize"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        JAVA_INT.withName("dwRecipientIndex"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("KeyEncryptionAlgorithm"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("UserKeyingMaterial"),
        JAVA_INT.withName("dwOriginatorChoice"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.unionLayout(
            MemoryLayout.structLayout(
                JAVA_INT.withName("dwIdChoice"),
                MemoryLayout.paddingLayout(4),
                MemoryLayout.unionLayout(
                    MemoryLayout.structLayout(
                        MemoryLayout.structLayout(
                            JAVA_INT.withName("cbData"),
                            MemoryLayout.paddingLayout(4),
                            RuntimeHelper.POINTER.withName("pbData")
                        ).withName("Issuer"),
                        MemoryLayout.structLayout(
                            JAVA_INT.withName("cbData"),
                            MemoryLayout.paddingLayout(4),
                            RuntimeHelper.POINTER.withName("pbData")
                        ).withName("SerialNumber")
                    ).withName("IssuerSerialNumber"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cbData"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pbData")
                    ).withName("KeyId"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cbData"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pbData")
                    ).withName("HashId")
                ).withName("$anon$0")
            ).withName("OriginatorCertId"),
            MemoryLayout.structLayout(
                MemoryLayout.structLayout(
                    RuntimeHelper.POINTER.withName("pszObjId"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cbData"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pbData")
                    ).withName("Parameters")
                ).withName("Algorithm"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData"),
                    JAVA_INT.withName("cUnusedBits"),
                    MemoryLayout.paddingLayout(4)
                ).withName("PublicKey")
            ).withName("OriginatorPublicKeyInfo")
        ).withName("$anon$0"),
        JAVA_INT.withName("cKeyAgreeKeyEncryptInfo"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgpKeyAgreeKeyEncryptInfo"),
        JAVA_INT.withName("dwFlags"),
        MemoryLayout.paddingLayout(4)
    ).withName("_CMSG_KEY_AGREE_ENCRYPT_INFO");
}


