// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$1941 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$1941() {}
    static final VarHandle const$0 = constants$1940.const$4.varHandle(MemoryLayout.PathElement.groupElement("cbSalt"));
    static final StructLayout const$1 = MemoryLayout.structLayout(
        RuntimeHelper.POINTER.withName("pszAlgId"),
        RuntimeHelper.POINTER.withName("pbLabel"),
        JAVA_INT.withName("cbLabel"),
        MemoryLayout.paddingLayout(4)
    ).withName("_BCRYPT_OAEP_PADDING_INFO");
    static final VarHandle const$2 = constants$1941.const$1.varHandle(MemoryLayout.PathElement.groupElement("pszAlgId"));
    static final VarHandle const$3 = constants$1941.const$1.varHandle(MemoryLayout.PathElement.groupElement("pbLabel"));
    static final VarHandle const$4 = constants$1941.const$1.varHandle(MemoryLayout.PathElement.groupElement("cbLabel"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        JAVA_INT.withName("dwInfoVersion"),
        RuntimeHelper.POINTER.withName("pbNonce"),
        JAVA_INT.withName("cbNonce"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pbAuthData"),
        JAVA_INT.withName("cbAuthData"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pbTag"),
        JAVA_INT.withName("cbTag"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pbMacContext"),
        JAVA_INT.withName("cbMacContext"),
        JAVA_INT.withName("cbAAD"),
        JAVA_LONG.withName("cbData"),
        JAVA_INT.withName("dwFlags"),
        MemoryLayout.paddingLayout(4)
    ).withName("_BCRYPT_AUTHENTICATED_CIPHER_MODE_INFO");
}


