// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2040 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2040() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("Forward"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("Reverse")
    ).withName("_CERT_PAIR");
    static final StructLayout const$1 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwDistPointNameChoice"),
            MemoryLayout.paddingLayout(4),
            MemoryLayout.unionLayout(
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cAltEntry"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("rgAltEntry")
                ).withName("FullName")
            ).withName("$anon$0")
        ).withName("DistPointName"),
        JAVA_INT.withName("fOnlyContainsUserCerts"),
        JAVA_INT.withName("fOnlyContainsCACerts"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData"),
            JAVA_INT.withName("cUnusedBits"),
            MemoryLayout.paddingLayout(4)
        ).withName("OnlySomeReasonFlags"),
        JAVA_INT.withName("fIndirectCRL"),
        MemoryLayout.paddingLayout(4)
    ).withName("_CRL_ISSUING_DIST_POINT");
    static final VarHandle const$2 = constants$2040.const$1.varHandle(MemoryLayout.PathElement.groupElement("fOnlyContainsUserCerts"));
    static final VarHandle const$3 = constants$2040.const$1.varHandle(MemoryLayout.PathElement.groupElement("fOnlyContainsCACerts"));
    static final VarHandle const$4 = constants$2040.const$1.varHandle(MemoryLayout.PathElement.groupElement("fIndirectCRL"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwAltNameChoice"),
            MemoryLayout.paddingLayout(4),
            MemoryLayout.unionLayout(
                RuntimeHelper.POINTER.withName("pOtherName"),
                RuntimeHelper.POINTER.withName("pwszRfc822Name"),
                RuntimeHelper.POINTER.withName("pwszDNSName"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData")
                ).withName("DirectoryName"),
                RuntimeHelper.POINTER.withName("pwszURL"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData")
                ).withName("IPAddress"),
                RuntimeHelper.POINTER.withName("pszRegisteredID")
            ).withName("$anon$0")
        ).withName("Base"),
        JAVA_INT.withName("dwMinimum"),
        JAVA_INT.withName("fMaximum"),
        JAVA_INT.withName("dwMaximum"),
        MemoryLayout.paddingLayout(4)
    ).withName("_CERT_GENERAL_SUBTREE");
}


