// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2266 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2266() {}
    static final VarHandle const$0 = constants$2265.const$2.varHandle(MemoryLayout.PathElement.groupElement("MaxCountArray"));
    static final VarHandle const$1 = constants$2265.const$2.varHandle(MemoryLayout.PathElement.groupElement("OffsetArray"));
    static final VarHandle const$2 = constants$2265.const$2.varHandle(MemoryLayout.PathElement.groupElement("ActualCountArray"));
    static final StructLayout const$3 = MemoryLayout.structLayout(
        RuntimeHelper.POINTER.withName("RpcMsg"),
        RuntimeHelper.POINTER.withName("Buffer"),
        RuntimeHelper.POINTER.withName("BufferStart"),
        RuntimeHelper.POINTER.withName("BufferEnd"),
        RuntimeHelper.POINTER.withName("BufferMark"),
        JAVA_INT.withName("BufferLength"),
        JAVA_INT.withName("MemorySize"),
        RuntimeHelper.POINTER.withName("Memory"),
        JAVA_BYTE.withName("IsClient"),
        JAVA_BYTE.withName("Pad"),
        JAVA_SHORT.withName("uFlags2"),
        JAVA_INT.withName("ReuseBuffer"),
        RuntimeHelper.POINTER.withName("pAllocAllNodesContext"),
        RuntimeHelper.POINTER.withName("pPointerQueueState"),
        JAVA_INT.withName("IgnoreEmbeddedPointers"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("PointerBufferMark"),
        JAVA_BYTE.withName("CorrDespIncrement"),
        JAVA_BYTE.withName("uFlags"),
        JAVA_SHORT.withName("UniquePtrCount"),
        MemoryLayout.paddingLayout(4),
        JAVA_LONG.withName("MaxCount"),
        JAVA_INT.withName("Offset"),
        JAVA_INT.withName("ActualCount"),
        RuntimeHelper.POINTER.withName("pfnAllocate"),
        RuntimeHelper.POINTER.withName("pfnFree"),
        RuntimeHelper.POINTER.withName("StackTop"),
        RuntimeHelper.POINTER.withName("pPresentedType"),
        RuntimeHelper.POINTER.withName("pTransmitType"),
        RuntimeHelper.POINTER.withName("SavedHandle"),
        RuntimeHelper.POINTER.withName("StubDesc"),
        RuntimeHelper.POINTER.withName("FullPtrXlatTables"),
        JAVA_INT.withName("FullPtrRefId"),
        JAVA_INT.withName("PointerLength"),
        MemoryLayout.paddingLayout(4),
        JAVA_INT.withName("dwDestContext"),
        RuntimeHelper.POINTER.withName("pvDestContext"),
        RuntimeHelper.POINTER.withName("SavedContextHandles"),
        JAVA_INT.withName("ParamNumber"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pRpcChannelBuffer"),
        RuntimeHelper.POINTER.withName("pArrayInfo"),
        RuntimeHelper.POINTER.withName("SizePtrCountArray"),
        RuntimeHelper.POINTER.withName("SizePtrOffsetArray"),
        RuntimeHelper.POINTER.withName("SizePtrLengthArray"),
        RuntimeHelper.POINTER.withName("pArgQueue"),
        JAVA_INT.withName("dwStubPhase"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("LowStackMark"),
        RuntimeHelper.POINTER.withName("pAsyncMsg"),
        RuntimeHelper.POINTER.withName("pCorrInfo"),
        RuntimeHelper.POINTER.withName("pCorrMemory"),
        RuntimeHelper.POINTER.withName("pMemoryList"),
        JAVA_LONG.withName("pCSInfo"),
        RuntimeHelper.POINTER.withName("ConformanceMark"),
        RuntimeHelper.POINTER.withName("VarianceMark"),
        JAVA_LONG.withName("Unused"),
        RuntimeHelper.POINTER.withName("pContext"),
        RuntimeHelper.POINTER.withName("ContextHandleHash"),
        RuntimeHelper.POINTER.withName("pUserMarshalList"),
        JAVA_LONG.withName("Reserved51_3"),
        JAVA_LONG.withName("Reserved51_4"),
        JAVA_LONG.withName("Reserved51_5")
    ).withName("_MIDL_STUB_MESSAGE");
    static final VarHandle const$4 = constants$2266.const$3.varHandle(MemoryLayout.PathElement.groupElement("RpcMsg"));
    static final VarHandle const$5 = constants$2266.const$3.varHandle(MemoryLayout.PathElement.groupElement("Buffer"));
}


