// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2047 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2047() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        RuntimeHelper.POINTER.withName("pszObjId"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("EncodingParameters")
    ).withName("_CRYPT_PSOURCE_ALGORITHM");
    static final VarHandle const$1 = constants$2047.const$0.varHandle(MemoryLayout.PathElement.groupElement("pszObjId"));
    static final StructLayout const$2 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("HashAlgorithm"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                RuntimeHelper.POINTER.withName("pszObjId"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData")
                ).withName("Parameters")
            ).withName("HashAlgorithm")
        ).withName("MaskGenAlgorithm"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("EncodingParameters")
        ).withName("PSourceAlgorithm")
    ).withName("_CRYPT_RSAES_OAEP_PARAMETERS");
    static final StructLayout const$3 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwBodyPartID"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            JAVA_INT.withName("cValue"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("rgValue")
        ).withName("Attribute")
    ).withName("_CMC_TAGGED_ATTRIBUTE");
    static final VarHandle const$4 = constants$2047.const$3.varHandle(MemoryLayout.PathElement.groupElement("dwBodyPartID"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwBodyPartID"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("SignedCertRequest")
    ).withName("_CMC_TAGGED_CERT_REQUEST");
}


