// Generated by jextract

package com.twitter.teruteru128.preview.opencl;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * union {
 *     cl_uchar s[16];
 *     struct {
 *         cl_uchar x;
 *         cl_uchar y;
 *         cl_uchar z;
 *         cl_uchar w;
 *         cl_uchar __spacer4;
 *         cl_uchar __spacer5;
 *         cl_uchar __spacer6;
 *         cl_uchar __spacer7;
 *         cl_uchar __spacer8;
 *         cl_uchar __spacer9;
 *         cl_uchar sa;
 *         cl_uchar sb;
 *         cl_uchar sc;
 *         cl_uchar sd;
 *         cl_uchar se;
 *         cl_uchar sf;
 *     };
 *     struct {
 *         cl_uchar s0;
 *         cl_uchar s1;
 *         cl_uchar s2;
 *         cl_uchar s3;
 *         cl_uchar s4;
 *         cl_uchar s5;
 *         cl_uchar s6;
 *         cl_uchar s7;
 *         cl_uchar s8;
 *         cl_uchar s9;
 *         cl_uchar sA;
 *         cl_uchar sB;
 *         cl_uchar sC;
 *         cl_uchar sD;
 *         cl_uchar sE;
 *         cl_uchar sF;
 *     };
 *     struct {
 *         cl_uchar8 lo;
 *         cl_uchar8 hi;
 *     };
 *     __cl_uchar8 v8[2];
 *     __cl_uchar16 v16;
 * }
 * }
 */
public class cl_uchar16 {

    cl_uchar16() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
        MemoryLayout.sequenceLayout(16, opencl_h.C_CHAR).withName("s"),
        MemoryLayout.structLayout(
            opencl_h.C_CHAR.withName("x"),
            opencl_h.C_CHAR.withName("y"),
            opencl_h.C_CHAR.withName("z"),
            opencl_h.C_CHAR.withName("w"),
            opencl_h.C_CHAR.withName("__spacer4"),
            opencl_h.C_CHAR.withName("__spacer5"),
            opencl_h.C_CHAR.withName("__spacer6"),
            opencl_h.C_CHAR.withName("__spacer7"),
            opencl_h.C_CHAR.withName("__spacer8"),
            opencl_h.C_CHAR.withName("__spacer9"),
            opencl_h.C_CHAR.withName("sa"),
            opencl_h.C_CHAR.withName("sb"),
            opencl_h.C_CHAR.withName("sc"),
            opencl_h.C_CHAR.withName("sd"),
            opencl_h.C_CHAR.withName("se"),
            opencl_h.C_CHAR.withName("sf")
        ).withName("$anon$688:23"),
        MemoryLayout.structLayout(
            opencl_h.C_CHAR.withName("s0"),
            opencl_h.C_CHAR.withName("s1"),
            opencl_h.C_CHAR.withName("s2"),
            opencl_h.C_CHAR.withName("s3"),
            opencl_h.C_CHAR.withName("s4"),
            opencl_h.C_CHAR.withName("s5"),
            opencl_h.C_CHAR.withName("s6"),
            opencl_h.C_CHAR.withName("s7"),
            opencl_h.C_CHAR.withName("s8"),
            opencl_h.C_CHAR.withName("s9"),
            opencl_h.C_CHAR.withName("sA"),
            opencl_h.C_CHAR.withName("sB"),
            opencl_h.C_CHAR.withName("sC"),
            opencl_h.C_CHAR.withName("sD"),
            opencl_h.C_CHAR.withName("sE"),
            opencl_h.C_CHAR.withName("sF")
        ).withName("$anon$689:23"),
        MemoryLayout.structLayout(
            cl_uchar8.layout().withName("lo"),
            cl_uchar8.layout().withName("hi")
        ).withName("$anon$690:23"),
        MemoryLayout.sequenceLayout(2, MemoryLayout.sequenceLayout(1, opencl_h.C_LONG_LONG)).withName("v8"),
        MemoryLayout.sequenceLayout(2, opencl_h.C_LONG_LONG).withName("v16")
    ).withName("$anon$684:9");

    /**
     * The layout of this union
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final SequenceLayout s$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("s"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar s[16]
     * }
     */
    public static final SequenceLayout s$layout() {
        return s$LAYOUT;
    }

    private static final long s$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar s[16]
     * }
     */
    public static final long s$offset() {
        return s$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar s[16]
     * }
     */
    public static MemorySegment s(MemorySegment union) {
        return union.asSlice(s$OFFSET, s$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar s[16]
     * }
     */
    public static void s(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, s$OFFSET, s$LAYOUT.byteSize());
    }

    private static long[] s$DIMS = { 16 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * cl_uchar s[16]
     * }
     */
    public static long[] s$dimensions() {
        return s$DIMS;
    }
    private static final VarHandle s$ELEM_HANDLE = s$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * cl_uchar s[16]
     * }
     */
    public static byte s(MemorySegment union, long index0) {
        return (byte)s$ELEM_HANDLE.get(union, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * cl_uchar s[16]
     * }
     */
    public static void s(MemorySegment union, long index0, byte fieldValue) {
        s$ELEM_HANDLE.set(union, 0L, index0, fieldValue);
    }

    private static final OfByte x$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("x"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar x
     * }
     */
    public static final OfByte x$layout() {
        return x$LAYOUT;
    }

    private static final long x$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar x
     * }
     */
    public static final long x$offset() {
        return x$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar x
     * }
     */
    public static byte x(MemorySegment union) {
        return union.get(x$LAYOUT, x$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar x
     * }
     */
    public static void x(MemorySegment union, byte fieldValue) {
        union.set(x$LAYOUT, x$OFFSET, fieldValue);
    }

    private static final OfByte y$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("y"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar y
     * }
     */
    public static final OfByte y$layout() {
        return y$LAYOUT;
    }

    private static final long y$OFFSET = 1;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar y
     * }
     */
    public static final long y$offset() {
        return y$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar y
     * }
     */
    public static byte y(MemorySegment union) {
        return union.get(y$LAYOUT, y$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar y
     * }
     */
    public static void y(MemorySegment union, byte fieldValue) {
        union.set(y$LAYOUT, y$OFFSET, fieldValue);
    }

    private static final OfByte z$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("z"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar z
     * }
     */
    public static final OfByte z$layout() {
        return z$LAYOUT;
    }

    private static final long z$OFFSET = 2;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar z
     * }
     */
    public static final long z$offset() {
        return z$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar z
     * }
     */
    public static byte z(MemorySegment union) {
        return union.get(z$LAYOUT, z$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar z
     * }
     */
    public static void z(MemorySegment union, byte fieldValue) {
        union.set(z$LAYOUT, z$OFFSET, fieldValue);
    }

    private static final OfByte w$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("w"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar w
     * }
     */
    public static final OfByte w$layout() {
        return w$LAYOUT;
    }

    private static final long w$OFFSET = 3;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar w
     * }
     */
    public static final long w$offset() {
        return w$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar w
     * }
     */
    public static byte w(MemorySegment union) {
        return union.get(w$LAYOUT, w$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar w
     * }
     */
    public static void w(MemorySegment union, byte fieldValue) {
        union.set(w$LAYOUT, w$OFFSET, fieldValue);
    }

    private static final OfByte __spacer4$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("__spacer4"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar __spacer4
     * }
     */
    public static final OfByte __spacer4$layout() {
        return __spacer4$LAYOUT;
    }

    private static final long __spacer4$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar __spacer4
     * }
     */
    public static final long __spacer4$offset() {
        return __spacer4$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar __spacer4
     * }
     */
    public static byte __spacer4(MemorySegment union) {
        return union.get(__spacer4$LAYOUT, __spacer4$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar __spacer4
     * }
     */
    public static void __spacer4(MemorySegment union, byte fieldValue) {
        union.set(__spacer4$LAYOUT, __spacer4$OFFSET, fieldValue);
    }

    private static final OfByte __spacer5$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("__spacer5"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar __spacer5
     * }
     */
    public static final OfByte __spacer5$layout() {
        return __spacer5$LAYOUT;
    }

    private static final long __spacer5$OFFSET = 5;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar __spacer5
     * }
     */
    public static final long __spacer5$offset() {
        return __spacer5$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar __spacer5
     * }
     */
    public static byte __spacer5(MemorySegment union) {
        return union.get(__spacer5$LAYOUT, __spacer5$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar __spacer5
     * }
     */
    public static void __spacer5(MemorySegment union, byte fieldValue) {
        union.set(__spacer5$LAYOUT, __spacer5$OFFSET, fieldValue);
    }

    private static final OfByte __spacer6$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("__spacer6"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar __spacer6
     * }
     */
    public static final OfByte __spacer6$layout() {
        return __spacer6$LAYOUT;
    }

    private static final long __spacer6$OFFSET = 6;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar __spacer6
     * }
     */
    public static final long __spacer6$offset() {
        return __spacer6$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar __spacer6
     * }
     */
    public static byte __spacer6(MemorySegment union) {
        return union.get(__spacer6$LAYOUT, __spacer6$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar __spacer6
     * }
     */
    public static void __spacer6(MemorySegment union, byte fieldValue) {
        union.set(__spacer6$LAYOUT, __spacer6$OFFSET, fieldValue);
    }

    private static final OfByte __spacer7$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("__spacer7"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar __spacer7
     * }
     */
    public static final OfByte __spacer7$layout() {
        return __spacer7$LAYOUT;
    }

    private static final long __spacer7$OFFSET = 7;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar __spacer7
     * }
     */
    public static final long __spacer7$offset() {
        return __spacer7$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar __spacer7
     * }
     */
    public static byte __spacer7(MemorySegment union) {
        return union.get(__spacer7$LAYOUT, __spacer7$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar __spacer7
     * }
     */
    public static void __spacer7(MemorySegment union, byte fieldValue) {
        union.set(__spacer7$LAYOUT, __spacer7$OFFSET, fieldValue);
    }

    private static final OfByte __spacer8$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("__spacer8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar __spacer8
     * }
     */
    public static final OfByte __spacer8$layout() {
        return __spacer8$LAYOUT;
    }

    private static final long __spacer8$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar __spacer8
     * }
     */
    public static final long __spacer8$offset() {
        return __spacer8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar __spacer8
     * }
     */
    public static byte __spacer8(MemorySegment union) {
        return union.get(__spacer8$LAYOUT, __spacer8$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar __spacer8
     * }
     */
    public static void __spacer8(MemorySegment union, byte fieldValue) {
        union.set(__spacer8$LAYOUT, __spacer8$OFFSET, fieldValue);
    }

    private static final OfByte __spacer9$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("__spacer9"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar __spacer9
     * }
     */
    public static final OfByte __spacer9$layout() {
        return __spacer9$LAYOUT;
    }

    private static final long __spacer9$OFFSET = 9;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar __spacer9
     * }
     */
    public static final long __spacer9$offset() {
        return __spacer9$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar __spacer9
     * }
     */
    public static byte __spacer9(MemorySegment union) {
        return union.get(__spacer9$LAYOUT, __spacer9$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar __spacer9
     * }
     */
    public static void __spacer9(MemorySegment union, byte fieldValue) {
        union.set(__spacer9$LAYOUT, __spacer9$OFFSET, fieldValue);
    }

    private static final OfByte sa$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("sa"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar sa
     * }
     */
    public static final OfByte sa$layout() {
        return sa$LAYOUT;
    }

    private static final long sa$OFFSET = 10;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar sa
     * }
     */
    public static final long sa$offset() {
        return sa$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar sa
     * }
     */
    public static byte sa(MemorySegment union) {
        return union.get(sa$LAYOUT, sa$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar sa
     * }
     */
    public static void sa(MemorySegment union, byte fieldValue) {
        union.set(sa$LAYOUT, sa$OFFSET, fieldValue);
    }

    private static final OfByte sb$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("sb"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar sb
     * }
     */
    public static final OfByte sb$layout() {
        return sb$LAYOUT;
    }

    private static final long sb$OFFSET = 11;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar sb
     * }
     */
    public static final long sb$offset() {
        return sb$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar sb
     * }
     */
    public static byte sb(MemorySegment union) {
        return union.get(sb$LAYOUT, sb$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar sb
     * }
     */
    public static void sb(MemorySegment union, byte fieldValue) {
        union.set(sb$LAYOUT, sb$OFFSET, fieldValue);
    }

    private static final OfByte sc$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("sc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar sc
     * }
     */
    public static final OfByte sc$layout() {
        return sc$LAYOUT;
    }

    private static final long sc$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar sc
     * }
     */
    public static final long sc$offset() {
        return sc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar sc
     * }
     */
    public static byte sc(MemorySegment union) {
        return union.get(sc$LAYOUT, sc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar sc
     * }
     */
    public static void sc(MemorySegment union, byte fieldValue) {
        union.set(sc$LAYOUT, sc$OFFSET, fieldValue);
    }

    private static final OfByte sd$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("sd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar sd
     * }
     */
    public static final OfByte sd$layout() {
        return sd$LAYOUT;
    }

    private static final long sd$OFFSET = 13;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar sd
     * }
     */
    public static final long sd$offset() {
        return sd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar sd
     * }
     */
    public static byte sd(MemorySegment union) {
        return union.get(sd$LAYOUT, sd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar sd
     * }
     */
    public static void sd(MemorySegment union, byte fieldValue) {
        union.set(sd$LAYOUT, sd$OFFSET, fieldValue);
    }

    private static final OfByte se$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("se"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar se
     * }
     */
    public static final OfByte se$layout() {
        return se$LAYOUT;
    }

    private static final long se$OFFSET = 14;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar se
     * }
     */
    public static final long se$offset() {
        return se$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar se
     * }
     */
    public static byte se(MemorySegment union) {
        return union.get(se$LAYOUT, se$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar se
     * }
     */
    public static void se(MemorySegment union, byte fieldValue) {
        union.set(se$LAYOUT, se$OFFSET, fieldValue);
    }

    private static final OfByte sf$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$688:23"), groupElement("sf"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar sf
     * }
     */
    public static final OfByte sf$layout() {
        return sf$LAYOUT;
    }

    private static final long sf$OFFSET = 15;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar sf
     * }
     */
    public static final long sf$offset() {
        return sf$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar sf
     * }
     */
    public static byte sf(MemorySegment union) {
        return union.get(sf$LAYOUT, sf$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar sf
     * }
     */
    public static void sf(MemorySegment union, byte fieldValue) {
        union.set(sf$LAYOUT, sf$OFFSET, fieldValue);
    }

    private static final OfByte s0$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("s0"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar s0
     * }
     */
    public static final OfByte s0$layout() {
        return s0$LAYOUT;
    }

    private static final long s0$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar s0
     * }
     */
    public static final long s0$offset() {
        return s0$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar s0
     * }
     */
    public static byte s0(MemorySegment union) {
        return union.get(s0$LAYOUT, s0$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar s0
     * }
     */
    public static void s0(MemorySegment union, byte fieldValue) {
        union.set(s0$LAYOUT, s0$OFFSET, fieldValue);
    }

    private static final OfByte s1$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("s1"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar s1
     * }
     */
    public static final OfByte s1$layout() {
        return s1$LAYOUT;
    }

    private static final long s1$OFFSET = 1;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar s1
     * }
     */
    public static final long s1$offset() {
        return s1$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar s1
     * }
     */
    public static byte s1(MemorySegment union) {
        return union.get(s1$LAYOUT, s1$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar s1
     * }
     */
    public static void s1(MemorySegment union, byte fieldValue) {
        union.set(s1$LAYOUT, s1$OFFSET, fieldValue);
    }

    private static final OfByte s2$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("s2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar s2
     * }
     */
    public static final OfByte s2$layout() {
        return s2$LAYOUT;
    }

    private static final long s2$OFFSET = 2;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar s2
     * }
     */
    public static final long s2$offset() {
        return s2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar s2
     * }
     */
    public static byte s2(MemorySegment union) {
        return union.get(s2$LAYOUT, s2$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar s2
     * }
     */
    public static void s2(MemorySegment union, byte fieldValue) {
        union.set(s2$LAYOUT, s2$OFFSET, fieldValue);
    }

    private static final OfByte s3$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("s3"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar s3
     * }
     */
    public static final OfByte s3$layout() {
        return s3$LAYOUT;
    }

    private static final long s3$OFFSET = 3;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar s3
     * }
     */
    public static final long s3$offset() {
        return s3$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar s3
     * }
     */
    public static byte s3(MemorySegment union) {
        return union.get(s3$LAYOUT, s3$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar s3
     * }
     */
    public static void s3(MemorySegment union, byte fieldValue) {
        union.set(s3$LAYOUT, s3$OFFSET, fieldValue);
    }

    private static final OfByte s4$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("s4"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar s4
     * }
     */
    public static final OfByte s4$layout() {
        return s4$LAYOUT;
    }

    private static final long s4$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar s4
     * }
     */
    public static final long s4$offset() {
        return s4$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar s4
     * }
     */
    public static byte s4(MemorySegment union) {
        return union.get(s4$LAYOUT, s4$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar s4
     * }
     */
    public static void s4(MemorySegment union, byte fieldValue) {
        union.set(s4$LAYOUT, s4$OFFSET, fieldValue);
    }

    private static final OfByte s5$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("s5"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar s5
     * }
     */
    public static final OfByte s5$layout() {
        return s5$LAYOUT;
    }

    private static final long s5$OFFSET = 5;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar s5
     * }
     */
    public static final long s5$offset() {
        return s5$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar s5
     * }
     */
    public static byte s5(MemorySegment union) {
        return union.get(s5$LAYOUT, s5$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar s5
     * }
     */
    public static void s5(MemorySegment union, byte fieldValue) {
        union.set(s5$LAYOUT, s5$OFFSET, fieldValue);
    }

    private static final OfByte s6$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("s6"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar s6
     * }
     */
    public static final OfByte s6$layout() {
        return s6$LAYOUT;
    }

    private static final long s6$OFFSET = 6;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar s6
     * }
     */
    public static final long s6$offset() {
        return s6$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar s6
     * }
     */
    public static byte s6(MemorySegment union) {
        return union.get(s6$LAYOUT, s6$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar s6
     * }
     */
    public static void s6(MemorySegment union, byte fieldValue) {
        union.set(s6$LAYOUT, s6$OFFSET, fieldValue);
    }

    private static final OfByte s7$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("s7"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar s7
     * }
     */
    public static final OfByte s7$layout() {
        return s7$LAYOUT;
    }

    private static final long s7$OFFSET = 7;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar s7
     * }
     */
    public static final long s7$offset() {
        return s7$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar s7
     * }
     */
    public static byte s7(MemorySegment union) {
        return union.get(s7$LAYOUT, s7$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar s7
     * }
     */
    public static void s7(MemorySegment union, byte fieldValue) {
        union.set(s7$LAYOUT, s7$OFFSET, fieldValue);
    }

    private static final OfByte s8$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("s8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar s8
     * }
     */
    public static final OfByte s8$layout() {
        return s8$LAYOUT;
    }

    private static final long s8$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar s8
     * }
     */
    public static final long s8$offset() {
        return s8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar s8
     * }
     */
    public static byte s8(MemorySegment union) {
        return union.get(s8$LAYOUT, s8$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar s8
     * }
     */
    public static void s8(MemorySegment union, byte fieldValue) {
        union.set(s8$LAYOUT, s8$OFFSET, fieldValue);
    }

    private static final OfByte s9$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("s9"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar s9
     * }
     */
    public static final OfByte s9$layout() {
        return s9$LAYOUT;
    }

    private static final long s9$OFFSET = 9;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar s9
     * }
     */
    public static final long s9$offset() {
        return s9$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar s9
     * }
     */
    public static byte s9(MemorySegment union) {
        return union.get(s9$LAYOUT, s9$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar s9
     * }
     */
    public static void s9(MemorySegment union, byte fieldValue) {
        union.set(s9$LAYOUT, s9$OFFSET, fieldValue);
    }

    private static final OfByte sA$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("sA"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar sA
     * }
     */
    public static final OfByte sA$layout() {
        return sA$LAYOUT;
    }

    private static final long sA$OFFSET = 10;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar sA
     * }
     */
    public static final long sA$offset() {
        return sA$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar sA
     * }
     */
    public static byte sA(MemorySegment union) {
        return union.get(sA$LAYOUT, sA$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar sA
     * }
     */
    public static void sA(MemorySegment union, byte fieldValue) {
        union.set(sA$LAYOUT, sA$OFFSET, fieldValue);
    }

    private static final OfByte sB$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("sB"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar sB
     * }
     */
    public static final OfByte sB$layout() {
        return sB$LAYOUT;
    }

    private static final long sB$OFFSET = 11;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar sB
     * }
     */
    public static final long sB$offset() {
        return sB$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar sB
     * }
     */
    public static byte sB(MemorySegment union) {
        return union.get(sB$LAYOUT, sB$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar sB
     * }
     */
    public static void sB(MemorySegment union, byte fieldValue) {
        union.set(sB$LAYOUT, sB$OFFSET, fieldValue);
    }

    private static final OfByte sC$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("sC"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar sC
     * }
     */
    public static final OfByte sC$layout() {
        return sC$LAYOUT;
    }

    private static final long sC$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar sC
     * }
     */
    public static final long sC$offset() {
        return sC$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar sC
     * }
     */
    public static byte sC(MemorySegment union) {
        return union.get(sC$LAYOUT, sC$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar sC
     * }
     */
    public static void sC(MemorySegment union, byte fieldValue) {
        union.set(sC$LAYOUT, sC$OFFSET, fieldValue);
    }

    private static final OfByte sD$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("sD"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar sD
     * }
     */
    public static final OfByte sD$layout() {
        return sD$LAYOUT;
    }

    private static final long sD$OFFSET = 13;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar sD
     * }
     */
    public static final long sD$offset() {
        return sD$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar sD
     * }
     */
    public static byte sD(MemorySegment union) {
        return union.get(sD$LAYOUT, sD$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar sD
     * }
     */
    public static void sD(MemorySegment union, byte fieldValue) {
        union.set(sD$LAYOUT, sD$OFFSET, fieldValue);
    }

    private static final OfByte sE$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("sE"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar sE
     * }
     */
    public static final OfByte sE$layout() {
        return sE$LAYOUT;
    }

    private static final long sE$OFFSET = 14;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar sE
     * }
     */
    public static final long sE$offset() {
        return sE$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar sE
     * }
     */
    public static byte sE(MemorySegment union) {
        return union.get(sE$LAYOUT, sE$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar sE
     * }
     */
    public static void sE(MemorySegment union, byte fieldValue) {
        union.set(sE$LAYOUT, sE$OFFSET, fieldValue);
    }

    private static final OfByte sF$LAYOUT = (OfByte)$LAYOUT.select(groupElement("$anon$689:23"), groupElement("sF"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar sF
     * }
     */
    public static final OfByte sF$layout() {
        return sF$LAYOUT;
    }

    private static final long sF$OFFSET = 15;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar sF
     * }
     */
    public static final long sF$offset() {
        return sF$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar sF
     * }
     */
    public static byte sF(MemorySegment union) {
        return union.get(sF$LAYOUT, sF$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar sF
     * }
     */
    public static void sF(MemorySegment union, byte fieldValue) {
        union.set(sF$LAYOUT, sF$OFFSET, fieldValue);
    }

    private static final GroupLayout lo$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$690:23"), groupElement("lo"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar8 lo
     * }
     */
    public static final GroupLayout lo$layout() {
        return lo$LAYOUT;
    }

    private static final long lo$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar8 lo
     * }
     */
    public static final long lo$offset() {
        return lo$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar8 lo
     * }
     */
    public static MemorySegment lo(MemorySegment union) {
        return union.asSlice(lo$OFFSET, lo$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar8 lo
     * }
     */
    public static void lo(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, lo$OFFSET, lo$LAYOUT.byteSize());
    }

    private static final GroupLayout hi$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$690:23"), groupElement("hi"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_uchar8 hi
     * }
     */
    public static final GroupLayout hi$layout() {
        return hi$LAYOUT;
    }

    private static final long hi$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_uchar8 hi
     * }
     */
    public static final long hi$offset() {
        return hi$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_uchar8 hi
     * }
     */
    public static MemorySegment hi(MemorySegment union) {
        return union.asSlice(hi$OFFSET, hi$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_uchar8 hi
     * }
     */
    public static void hi(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, hi$OFFSET, hi$LAYOUT.byteSize());
    }

    private static final SequenceLayout v8$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("v8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __cl_uchar8 v8[2]
     * }
     */
    public static final SequenceLayout v8$layout() {
        return v8$LAYOUT;
    }

    private static final long v8$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __cl_uchar8 v8[2]
     * }
     */
    public static final long v8$offset() {
        return v8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __cl_uchar8 v8[2]
     * }
     */
    public static MemorySegment v8(MemorySegment union) {
        return union.asSlice(v8$OFFSET, v8$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __cl_uchar8 v8[2]
     * }
     */
    public static void v8(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, v8$OFFSET, v8$LAYOUT.byteSize());
    }

    private static long[] v8$DIMS = { 2 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __cl_uchar8 v8[2]
     * }
     */
    public static long[] v8$dimensions() {
        return v8$DIMS;
    }
    private static final VarHandle v8$ELEM_HANDLE = v8$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __cl_uchar8 v8[2]
     * }
     */
    public static MemorySegment v8(MemorySegment union, long index0) {
        return (MemorySegment)v8$ELEM_HANDLE.get(union, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __cl_uchar8 v8[2]
     * }
     */
    public static void v8(MemorySegment union, long index0, MemorySegment fieldValue) {
        v8$ELEM_HANDLE.set(union, 0L, index0, fieldValue);
    }

    private static final SequenceLayout v16$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("v16"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __cl_uchar16 v16
     * }
     */
    public static final SequenceLayout v16$layout() {
        return v16$LAYOUT;
    }

    private static final long v16$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __cl_uchar16 v16
     * }
     */
    public static final long v16$offset() {
        return v16$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __cl_uchar16 v16
     * }
     */
    public static MemorySegment v16(MemorySegment union) {
        return union.asSlice(v16$OFFSET, v16$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __cl_uchar16 v16
     * }
     */
    public static void v16(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, v16$OFFSET, v16$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
