// Generated by jextract

package com.github.teruteru128.preview.opencl;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * union {
 *     cl_double s[16];
 *     struct {
 *         cl_double x;
 *         cl_double y;
 *         cl_double z;
 *         cl_double w;
 *         cl_double __spacer4;
 *         cl_double __spacer5;
 *         cl_double __spacer6;
 *         cl_double __spacer7;
 *         cl_double __spacer8;
 *         cl_double __spacer9;
 *         cl_double sa;
 *         cl_double sb;
 *         cl_double sc;
 *         cl_double sd;
 *         cl_double se;
 *         cl_double sf;
 *     };
 *     struct {
 *         cl_double s0;
 *         cl_double s1;
 *         cl_double s2;
 *         cl_double s3;
 *         cl_double s4;
 *         cl_double s5;
 *         cl_double s6;
 *         cl_double s7;
 *         cl_double s8;
 *         cl_double s9;
 *         cl_double sA;
 *         cl_double sB;
 *         cl_double sC;
 *         cl_double sD;
 *         cl_double sE;
 *         cl_double sF;
 *     };
 *     struct {
 *         cl_double8 lo;
 *         cl_double8 hi;
 *     };
 *     __cl_double2 v2[8];
 * }
 * }
 */
public class cl_double16 {

    cl_double16() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
        MemoryLayout.sequenceLayout(16, opencl_h.C_DOUBLE).withName("s"),
        MemoryLayout.structLayout(
            opencl_h.C_DOUBLE.withName("x"),
            opencl_h.C_DOUBLE.withName("y"),
            opencl_h.C_DOUBLE.withName("z"),
            opencl_h.C_DOUBLE.withName("w"),
            opencl_h.C_DOUBLE.withName("__spacer4"),
            opencl_h.C_DOUBLE.withName("__spacer5"),
            opencl_h.C_DOUBLE.withName("__spacer6"),
            opencl_h.C_DOUBLE.withName("__spacer7"),
            opencl_h.C_DOUBLE.withName("__spacer8"),
            opencl_h.C_DOUBLE.withName("__spacer9"),
            opencl_h.C_DOUBLE.withName("sa"),
            opencl_h.C_DOUBLE.withName("sb"),
            opencl_h.C_DOUBLE.withName("sc"),
            opencl_h.C_DOUBLE.withName("sd"),
            opencl_h.C_DOUBLE.withName("se"),
            opencl_h.C_DOUBLE.withName("sf")
        ).withName("$anon$1362:23"),
        MemoryLayout.structLayout(
            opencl_h.C_DOUBLE.withName("s0"),
            opencl_h.C_DOUBLE.withName("s1"),
            opencl_h.C_DOUBLE.withName("s2"),
            opencl_h.C_DOUBLE.withName("s3"),
            opencl_h.C_DOUBLE.withName("s4"),
            opencl_h.C_DOUBLE.withName("s5"),
            opencl_h.C_DOUBLE.withName("s6"),
            opencl_h.C_DOUBLE.withName("s7"),
            opencl_h.C_DOUBLE.withName("s8"),
            opencl_h.C_DOUBLE.withName("s9"),
            opencl_h.C_DOUBLE.withName("sA"),
            opencl_h.C_DOUBLE.withName("sB"),
            opencl_h.C_DOUBLE.withName("sC"),
            opencl_h.C_DOUBLE.withName("sD"),
            opencl_h.C_DOUBLE.withName("sE"),
            opencl_h.C_DOUBLE.withName("sF")
        ).withName("$anon$1363:23"),
        MemoryLayout.structLayout(
            cl_double8.layout().withName("lo"),
            cl_double8.layout().withName("hi")
        ).withName("$anon$1364:23"),
        MemoryLayout.sequenceLayout(8, MemoryLayout.sequenceLayout(2, opencl_h.C_DOUBLE)).withName("v2")
    ).withName("$anon$1358:9");

    /**
     * The layout of this union
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final SequenceLayout s$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("s"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double s[16]
     * }
     */
    public static final SequenceLayout s$layout() {
        return s$LAYOUT;
    }

    private static final long s$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double s[16]
     * }
     */
    public static final long s$offset() {
        return s$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double s[16]
     * }
     */
    public static MemorySegment s(MemorySegment union) {
        return union.asSlice(s$OFFSET, s$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double s[16]
     * }
     */
    public static void s(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, s$OFFSET, s$LAYOUT.byteSize());
    }

    private static long[] s$DIMS = { 16 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * cl_double s[16]
     * }
     */
    public static long[] s$dimensions() {
        return s$DIMS;
    }
    private static final VarHandle s$ELEM_HANDLE = s$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * cl_double s[16]
     * }
     */
    public static double s(MemorySegment union, long index0) {
        return (double)s$ELEM_HANDLE.get(union, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * cl_double s[16]
     * }
     */
    public static void s(MemorySegment union, long index0, double fieldValue) {
        s$ELEM_HANDLE.set(union, 0L, index0, fieldValue);
    }

    private static final OfDouble x$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("x"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double x
     * }
     */
    public static final OfDouble x$layout() {
        return x$LAYOUT;
    }

    private static final long x$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double x
     * }
     */
    public static final long x$offset() {
        return x$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double x
     * }
     */
    public static double x(MemorySegment union) {
        return union.get(x$LAYOUT, x$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double x
     * }
     */
    public static void x(MemorySegment union, double fieldValue) {
        union.set(x$LAYOUT, x$OFFSET, fieldValue);
    }

    private static final OfDouble y$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("y"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double y
     * }
     */
    public static final OfDouble y$layout() {
        return y$LAYOUT;
    }

    private static final long y$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double y
     * }
     */
    public static final long y$offset() {
        return y$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double y
     * }
     */
    public static double y(MemorySegment union) {
        return union.get(y$LAYOUT, y$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double y
     * }
     */
    public static void y(MemorySegment union, double fieldValue) {
        union.set(y$LAYOUT, y$OFFSET, fieldValue);
    }

    private static final OfDouble z$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("z"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double z
     * }
     */
    public static final OfDouble z$layout() {
        return z$LAYOUT;
    }

    private static final long z$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double z
     * }
     */
    public static final long z$offset() {
        return z$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double z
     * }
     */
    public static double z(MemorySegment union) {
        return union.get(z$LAYOUT, z$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double z
     * }
     */
    public static void z(MemorySegment union, double fieldValue) {
        union.set(z$LAYOUT, z$OFFSET, fieldValue);
    }

    private static final OfDouble w$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("w"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double w
     * }
     */
    public static final OfDouble w$layout() {
        return w$LAYOUT;
    }

    private static final long w$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double w
     * }
     */
    public static final long w$offset() {
        return w$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double w
     * }
     */
    public static double w(MemorySegment union) {
        return union.get(w$LAYOUT, w$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double w
     * }
     */
    public static void w(MemorySegment union, double fieldValue) {
        union.set(w$LAYOUT, w$OFFSET, fieldValue);
    }

    private static final OfDouble __spacer4$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("__spacer4"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double __spacer4
     * }
     */
    public static final OfDouble __spacer4$layout() {
        return __spacer4$LAYOUT;
    }

    private static final long __spacer4$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double __spacer4
     * }
     */
    public static final long __spacer4$offset() {
        return __spacer4$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double __spacer4
     * }
     */
    public static double __spacer4(MemorySegment union) {
        return union.get(__spacer4$LAYOUT, __spacer4$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double __spacer4
     * }
     */
    public static void __spacer4(MemorySegment union, double fieldValue) {
        union.set(__spacer4$LAYOUT, __spacer4$OFFSET, fieldValue);
    }

    private static final OfDouble __spacer5$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("__spacer5"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double __spacer5
     * }
     */
    public static final OfDouble __spacer5$layout() {
        return __spacer5$LAYOUT;
    }

    private static final long __spacer5$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double __spacer5
     * }
     */
    public static final long __spacer5$offset() {
        return __spacer5$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double __spacer5
     * }
     */
    public static double __spacer5(MemorySegment union) {
        return union.get(__spacer5$LAYOUT, __spacer5$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double __spacer5
     * }
     */
    public static void __spacer5(MemorySegment union, double fieldValue) {
        union.set(__spacer5$LAYOUT, __spacer5$OFFSET, fieldValue);
    }

    private static final OfDouble __spacer6$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("__spacer6"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double __spacer6
     * }
     */
    public static final OfDouble __spacer6$layout() {
        return __spacer6$LAYOUT;
    }

    private static final long __spacer6$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double __spacer6
     * }
     */
    public static final long __spacer6$offset() {
        return __spacer6$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double __spacer6
     * }
     */
    public static double __spacer6(MemorySegment union) {
        return union.get(__spacer6$LAYOUT, __spacer6$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double __spacer6
     * }
     */
    public static void __spacer6(MemorySegment union, double fieldValue) {
        union.set(__spacer6$LAYOUT, __spacer6$OFFSET, fieldValue);
    }

    private static final OfDouble __spacer7$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("__spacer7"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double __spacer7
     * }
     */
    public static final OfDouble __spacer7$layout() {
        return __spacer7$LAYOUT;
    }

    private static final long __spacer7$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double __spacer7
     * }
     */
    public static final long __spacer7$offset() {
        return __spacer7$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double __spacer7
     * }
     */
    public static double __spacer7(MemorySegment union) {
        return union.get(__spacer7$LAYOUT, __spacer7$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double __spacer7
     * }
     */
    public static void __spacer7(MemorySegment union, double fieldValue) {
        union.set(__spacer7$LAYOUT, __spacer7$OFFSET, fieldValue);
    }

    private static final OfDouble __spacer8$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("__spacer8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double __spacer8
     * }
     */
    public static final OfDouble __spacer8$layout() {
        return __spacer8$LAYOUT;
    }

    private static final long __spacer8$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double __spacer8
     * }
     */
    public static final long __spacer8$offset() {
        return __spacer8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double __spacer8
     * }
     */
    public static double __spacer8(MemorySegment union) {
        return union.get(__spacer8$LAYOUT, __spacer8$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double __spacer8
     * }
     */
    public static void __spacer8(MemorySegment union, double fieldValue) {
        union.set(__spacer8$LAYOUT, __spacer8$OFFSET, fieldValue);
    }

    private static final OfDouble __spacer9$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("__spacer9"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double __spacer9
     * }
     */
    public static final OfDouble __spacer9$layout() {
        return __spacer9$LAYOUT;
    }

    private static final long __spacer9$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double __spacer9
     * }
     */
    public static final long __spacer9$offset() {
        return __spacer9$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double __spacer9
     * }
     */
    public static double __spacer9(MemorySegment union) {
        return union.get(__spacer9$LAYOUT, __spacer9$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double __spacer9
     * }
     */
    public static void __spacer9(MemorySegment union, double fieldValue) {
        union.set(__spacer9$LAYOUT, __spacer9$OFFSET, fieldValue);
    }

    private static final OfDouble sa$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("sa"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double sa
     * }
     */
    public static final OfDouble sa$layout() {
        return sa$LAYOUT;
    }

    private static final long sa$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double sa
     * }
     */
    public static final long sa$offset() {
        return sa$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double sa
     * }
     */
    public static double sa(MemorySegment union) {
        return union.get(sa$LAYOUT, sa$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double sa
     * }
     */
    public static void sa(MemorySegment union, double fieldValue) {
        union.set(sa$LAYOUT, sa$OFFSET, fieldValue);
    }

    private static final OfDouble sb$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("sb"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double sb
     * }
     */
    public static final OfDouble sb$layout() {
        return sb$LAYOUT;
    }

    private static final long sb$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double sb
     * }
     */
    public static final long sb$offset() {
        return sb$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double sb
     * }
     */
    public static double sb(MemorySegment union) {
        return union.get(sb$LAYOUT, sb$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double sb
     * }
     */
    public static void sb(MemorySegment union, double fieldValue) {
        union.set(sb$LAYOUT, sb$OFFSET, fieldValue);
    }

    private static final OfDouble sc$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("sc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double sc
     * }
     */
    public static final OfDouble sc$layout() {
        return sc$LAYOUT;
    }

    private static final long sc$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double sc
     * }
     */
    public static final long sc$offset() {
        return sc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double sc
     * }
     */
    public static double sc(MemorySegment union) {
        return union.get(sc$LAYOUT, sc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double sc
     * }
     */
    public static void sc(MemorySegment union, double fieldValue) {
        union.set(sc$LAYOUT, sc$OFFSET, fieldValue);
    }

    private static final OfDouble sd$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("sd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double sd
     * }
     */
    public static final OfDouble sd$layout() {
        return sd$LAYOUT;
    }

    private static final long sd$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double sd
     * }
     */
    public static final long sd$offset() {
        return sd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double sd
     * }
     */
    public static double sd(MemorySegment union) {
        return union.get(sd$LAYOUT, sd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double sd
     * }
     */
    public static void sd(MemorySegment union, double fieldValue) {
        union.set(sd$LAYOUT, sd$OFFSET, fieldValue);
    }

    private static final OfDouble se$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("se"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double se
     * }
     */
    public static final OfDouble se$layout() {
        return se$LAYOUT;
    }

    private static final long se$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double se
     * }
     */
    public static final long se$offset() {
        return se$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double se
     * }
     */
    public static double se(MemorySegment union) {
        return union.get(se$LAYOUT, se$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double se
     * }
     */
    public static void se(MemorySegment union, double fieldValue) {
        union.set(se$LAYOUT, se$OFFSET, fieldValue);
    }

    private static final OfDouble sf$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1362:23"), groupElement("sf"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double sf
     * }
     */
    public static final OfDouble sf$layout() {
        return sf$LAYOUT;
    }

    private static final long sf$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double sf
     * }
     */
    public static final long sf$offset() {
        return sf$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double sf
     * }
     */
    public static double sf(MemorySegment union) {
        return union.get(sf$LAYOUT, sf$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double sf
     * }
     */
    public static void sf(MemorySegment union, double fieldValue) {
        union.set(sf$LAYOUT, sf$OFFSET, fieldValue);
    }

    private static final OfDouble s0$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("s0"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double s0
     * }
     */
    public static final OfDouble s0$layout() {
        return s0$LAYOUT;
    }

    private static final long s0$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double s0
     * }
     */
    public static final long s0$offset() {
        return s0$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double s0
     * }
     */
    public static double s0(MemorySegment union) {
        return union.get(s0$LAYOUT, s0$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double s0
     * }
     */
    public static void s0(MemorySegment union, double fieldValue) {
        union.set(s0$LAYOUT, s0$OFFSET, fieldValue);
    }

    private static final OfDouble s1$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("s1"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double s1
     * }
     */
    public static final OfDouble s1$layout() {
        return s1$LAYOUT;
    }

    private static final long s1$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double s1
     * }
     */
    public static final long s1$offset() {
        return s1$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double s1
     * }
     */
    public static double s1(MemorySegment union) {
        return union.get(s1$LAYOUT, s1$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double s1
     * }
     */
    public static void s1(MemorySegment union, double fieldValue) {
        union.set(s1$LAYOUT, s1$OFFSET, fieldValue);
    }

    private static final OfDouble s2$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("s2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double s2
     * }
     */
    public static final OfDouble s2$layout() {
        return s2$LAYOUT;
    }

    private static final long s2$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double s2
     * }
     */
    public static final long s2$offset() {
        return s2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double s2
     * }
     */
    public static double s2(MemorySegment union) {
        return union.get(s2$LAYOUT, s2$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double s2
     * }
     */
    public static void s2(MemorySegment union, double fieldValue) {
        union.set(s2$LAYOUT, s2$OFFSET, fieldValue);
    }

    private static final OfDouble s3$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("s3"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double s3
     * }
     */
    public static final OfDouble s3$layout() {
        return s3$LAYOUT;
    }

    private static final long s3$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double s3
     * }
     */
    public static final long s3$offset() {
        return s3$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double s3
     * }
     */
    public static double s3(MemorySegment union) {
        return union.get(s3$LAYOUT, s3$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double s3
     * }
     */
    public static void s3(MemorySegment union, double fieldValue) {
        union.set(s3$LAYOUT, s3$OFFSET, fieldValue);
    }

    private static final OfDouble s4$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("s4"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double s4
     * }
     */
    public static final OfDouble s4$layout() {
        return s4$LAYOUT;
    }

    private static final long s4$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double s4
     * }
     */
    public static final long s4$offset() {
        return s4$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double s4
     * }
     */
    public static double s4(MemorySegment union) {
        return union.get(s4$LAYOUT, s4$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double s4
     * }
     */
    public static void s4(MemorySegment union, double fieldValue) {
        union.set(s4$LAYOUT, s4$OFFSET, fieldValue);
    }

    private static final OfDouble s5$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("s5"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double s5
     * }
     */
    public static final OfDouble s5$layout() {
        return s5$LAYOUT;
    }

    private static final long s5$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double s5
     * }
     */
    public static final long s5$offset() {
        return s5$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double s5
     * }
     */
    public static double s5(MemorySegment union) {
        return union.get(s5$LAYOUT, s5$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double s5
     * }
     */
    public static void s5(MemorySegment union, double fieldValue) {
        union.set(s5$LAYOUT, s5$OFFSET, fieldValue);
    }

    private static final OfDouble s6$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("s6"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double s6
     * }
     */
    public static final OfDouble s6$layout() {
        return s6$LAYOUT;
    }

    private static final long s6$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double s6
     * }
     */
    public static final long s6$offset() {
        return s6$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double s6
     * }
     */
    public static double s6(MemorySegment union) {
        return union.get(s6$LAYOUT, s6$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double s6
     * }
     */
    public static void s6(MemorySegment union, double fieldValue) {
        union.set(s6$LAYOUT, s6$OFFSET, fieldValue);
    }

    private static final OfDouble s7$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("s7"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double s7
     * }
     */
    public static final OfDouble s7$layout() {
        return s7$LAYOUT;
    }

    private static final long s7$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double s7
     * }
     */
    public static final long s7$offset() {
        return s7$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double s7
     * }
     */
    public static double s7(MemorySegment union) {
        return union.get(s7$LAYOUT, s7$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double s7
     * }
     */
    public static void s7(MemorySegment union, double fieldValue) {
        union.set(s7$LAYOUT, s7$OFFSET, fieldValue);
    }

    private static final OfDouble s8$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("s8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double s8
     * }
     */
    public static final OfDouble s8$layout() {
        return s8$LAYOUT;
    }

    private static final long s8$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double s8
     * }
     */
    public static final long s8$offset() {
        return s8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double s8
     * }
     */
    public static double s8(MemorySegment union) {
        return union.get(s8$LAYOUT, s8$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double s8
     * }
     */
    public static void s8(MemorySegment union, double fieldValue) {
        union.set(s8$LAYOUT, s8$OFFSET, fieldValue);
    }

    private static final OfDouble s9$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("s9"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double s9
     * }
     */
    public static final OfDouble s9$layout() {
        return s9$LAYOUT;
    }

    private static final long s9$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double s9
     * }
     */
    public static final long s9$offset() {
        return s9$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double s9
     * }
     */
    public static double s9(MemorySegment union) {
        return union.get(s9$LAYOUT, s9$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double s9
     * }
     */
    public static void s9(MemorySegment union, double fieldValue) {
        union.set(s9$LAYOUT, s9$OFFSET, fieldValue);
    }

    private static final OfDouble sA$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("sA"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double sA
     * }
     */
    public static final OfDouble sA$layout() {
        return sA$LAYOUT;
    }

    private static final long sA$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double sA
     * }
     */
    public static final long sA$offset() {
        return sA$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double sA
     * }
     */
    public static double sA(MemorySegment union) {
        return union.get(sA$LAYOUT, sA$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double sA
     * }
     */
    public static void sA(MemorySegment union, double fieldValue) {
        union.set(sA$LAYOUT, sA$OFFSET, fieldValue);
    }

    private static final OfDouble sB$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("sB"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double sB
     * }
     */
    public static final OfDouble sB$layout() {
        return sB$LAYOUT;
    }

    private static final long sB$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double sB
     * }
     */
    public static final long sB$offset() {
        return sB$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double sB
     * }
     */
    public static double sB(MemorySegment union) {
        return union.get(sB$LAYOUT, sB$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double sB
     * }
     */
    public static void sB(MemorySegment union, double fieldValue) {
        union.set(sB$LAYOUT, sB$OFFSET, fieldValue);
    }

    private static final OfDouble sC$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("sC"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double sC
     * }
     */
    public static final OfDouble sC$layout() {
        return sC$LAYOUT;
    }

    private static final long sC$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double sC
     * }
     */
    public static final long sC$offset() {
        return sC$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double sC
     * }
     */
    public static double sC(MemorySegment union) {
        return union.get(sC$LAYOUT, sC$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double sC
     * }
     */
    public static void sC(MemorySegment union, double fieldValue) {
        union.set(sC$LAYOUT, sC$OFFSET, fieldValue);
    }

    private static final OfDouble sD$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("sD"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double sD
     * }
     */
    public static final OfDouble sD$layout() {
        return sD$LAYOUT;
    }

    private static final long sD$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double sD
     * }
     */
    public static final long sD$offset() {
        return sD$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double sD
     * }
     */
    public static double sD(MemorySegment union) {
        return union.get(sD$LAYOUT, sD$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double sD
     * }
     */
    public static void sD(MemorySegment union, double fieldValue) {
        union.set(sD$LAYOUT, sD$OFFSET, fieldValue);
    }

    private static final OfDouble sE$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("sE"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double sE
     * }
     */
    public static final OfDouble sE$layout() {
        return sE$LAYOUT;
    }

    private static final long sE$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double sE
     * }
     */
    public static final long sE$offset() {
        return sE$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double sE
     * }
     */
    public static double sE(MemorySegment union) {
        return union.get(sE$LAYOUT, sE$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double sE
     * }
     */
    public static void sE(MemorySegment union, double fieldValue) {
        union.set(sE$LAYOUT, sE$OFFSET, fieldValue);
    }

    private static final OfDouble sF$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("$anon$1363:23"), groupElement("sF"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double sF
     * }
     */
    public static final OfDouble sF$layout() {
        return sF$LAYOUT;
    }

    private static final long sF$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double sF
     * }
     */
    public static final long sF$offset() {
        return sF$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double sF
     * }
     */
    public static double sF(MemorySegment union) {
        return union.get(sF$LAYOUT, sF$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double sF
     * }
     */
    public static void sF(MemorySegment union, double fieldValue) {
        union.set(sF$LAYOUT, sF$OFFSET, fieldValue);
    }

    private static final GroupLayout lo$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$1364:23"), groupElement("lo"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double8 lo
     * }
     */
    public static final GroupLayout lo$layout() {
        return lo$LAYOUT;
    }

    private static final long lo$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double8 lo
     * }
     */
    public static final long lo$offset() {
        return lo$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double8 lo
     * }
     */
    public static MemorySegment lo(MemorySegment union) {
        return union.asSlice(lo$OFFSET, lo$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double8 lo
     * }
     */
    public static void lo(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, lo$OFFSET, lo$LAYOUT.byteSize());
    }

    private static final GroupLayout hi$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$1364:23"), groupElement("hi"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_double8 hi
     * }
     */
    public static final GroupLayout hi$layout() {
        return hi$LAYOUT;
    }

    private static final long hi$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_double8 hi
     * }
     */
    public static final long hi$offset() {
        return hi$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_double8 hi
     * }
     */
    public static MemorySegment hi(MemorySegment union) {
        return union.asSlice(hi$OFFSET, hi$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_double8 hi
     * }
     */
    public static void hi(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, hi$OFFSET, hi$LAYOUT.byteSize());
    }

    private static final SequenceLayout v2$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("v2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __cl_double2 v2[8]
     * }
     */
    public static final SequenceLayout v2$layout() {
        return v2$LAYOUT;
    }

    private static final long v2$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __cl_double2 v2[8]
     * }
     */
    public static final long v2$offset() {
        return v2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __cl_double2 v2[8]
     * }
     */
    public static MemorySegment v2(MemorySegment union) {
        return union.asSlice(v2$OFFSET, v2$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __cl_double2 v2[8]
     * }
     */
    public static void v2(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, v2$OFFSET, v2$LAYOUT.byteSize());
    }

    private static long[] v2$DIMS = { 8 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __cl_double2 v2[8]
     * }
     */
    public static long[] v2$dimensions() {
        return v2$DIMS;
    }
