// Generated by jextract

package com.github.teruteru128.preview.opencl;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * union {
 *     cl_short s[16];
 *     struct {
 *         cl_short x;
 *         cl_short y;
 *         cl_short z;
 *         cl_short w;
 *         cl_short __spacer4;
 *         cl_short __spacer5;
 *         cl_short __spacer6;
 *         cl_short __spacer7;
 *         cl_short __spacer8;
 *         cl_short __spacer9;
 *         cl_short sa;
 *         cl_short sb;
 *         cl_short sc;
 *         cl_short sd;
 *         cl_short se;
 *         cl_short sf;
 *     };
 *     struct {
 *         cl_short s0;
 *         cl_short s1;
 *         cl_short s2;
 *         cl_short s3;
 *         cl_short s4;
 *         cl_short s5;
 *         cl_short s6;
 *         cl_short s7;
 *         cl_short s8;
 *         cl_short s9;
 *         cl_short sA;
 *         cl_short sB;
 *         cl_short sC;
 *         cl_short sD;
 *         cl_short sE;
 *         cl_short sF;
 *     };
 *     struct {
 *         cl_short8 lo;
 *         cl_short8 hi;
 *     };
 *     __cl_short4 v4[4];
 *     __cl_short8 v8[2];
 * }
 * }
 */
public class cl_short16 {

    cl_short16() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
        MemoryLayout.sequenceLayout(16, opencl_h.C_SHORT).withName("s"),
        MemoryLayout.structLayout(
            opencl_h.C_SHORT.withName("x"),
            opencl_h.C_SHORT.withName("y"),
            opencl_h.C_SHORT.withName("z"),
            opencl_h.C_SHORT.withName("w"),
            opencl_h.C_SHORT.withName("__spacer4"),
            opencl_h.C_SHORT.withName("__spacer5"),
            opencl_h.C_SHORT.withName("__spacer6"),
            opencl_h.C_SHORT.withName("__spacer7"),
            opencl_h.C_SHORT.withName("__spacer8"),
            opencl_h.C_SHORT.withName("__spacer9"),
            opencl_h.C_SHORT.withName("sa"),
            opencl_h.C_SHORT.withName("sb"),
            opencl_h.C_SHORT.withName("sc"),
            opencl_h.C_SHORT.withName("sd"),
            opencl_h.C_SHORT.withName("se"),
            opencl_h.C_SHORT.withName("sf")
        ).withName("$anon$763:23"),
        MemoryLayout.structLayout(
            opencl_h.C_SHORT.withName("s0"),
            opencl_h.C_SHORT.withName("s1"),
            opencl_h.C_SHORT.withName("s2"),
            opencl_h.C_SHORT.withName("s3"),
            opencl_h.C_SHORT.withName("s4"),
            opencl_h.C_SHORT.withName("s5"),
            opencl_h.C_SHORT.withName("s6"),
            opencl_h.C_SHORT.withName("s7"),
            opencl_h.C_SHORT.withName("s8"),
            opencl_h.C_SHORT.withName("s9"),
            opencl_h.C_SHORT.withName("sA"),
            opencl_h.C_SHORT.withName("sB"),
            opencl_h.C_SHORT.withName("sC"),
            opencl_h.C_SHORT.withName("sD"),
            opencl_h.C_SHORT.withName("sE"),
            opencl_h.C_SHORT.withName("sF")
        ).withName("$anon$764:23"),
        MemoryLayout.structLayout(
            cl_short8.layout().withName("lo"),
            cl_short8.layout().withName("hi")
        ).withName("$anon$765:23"),
        MemoryLayout.sequenceLayout(4, MemoryLayout.sequenceLayout(1, opencl_h.C_LONG_LONG)).withName("v4"),
        MemoryLayout.sequenceLayout(2, MemoryLayout.sequenceLayout(2, opencl_h.C_LONG_LONG)).withName("v8")
    ).withName("$anon$759:9");

    /**
     * The layout of this union
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final SequenceLayout s$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("s"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short s[16]
     * }
     */
    public static final SequenceLayout s$layout() {
        return s$LAYOUT;
    }

    private static final long s$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short s[16]
     * }
     */
    public static final long s$offset() {
        return s$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short s[16]
     * }
     */
    public static MemorySegment s(MemorySegment union) {
        return union.asSlice(s$OFFSET, s$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short s[16]
     * }
     */
    public static void s(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, s$OFFSET, s$LAYOUT.byteSize());
    }

    private static long[] s$DIMS = { 16 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * cl_short s[16]
     * }
     */
    public static long[] s$dimensions() {
        return s$DIMS;
    }
    private static final VarHandle s$ELEM_HANDLE = s$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * cl_short s[16]
     * }
     */
    public static short s(MemorySegment union, long index0) {
        return (short)s$ELEM_HANDLE.get(union, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * cl_short s[16]
     * }
     */
    public static void s(MemorySegment union, long index0, short fieldValue) {
        s$ELEM_HANDLE.set(union, 0L, index0, fieldValue);
    }

    private static final OfShort x$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("x"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short x
     * }
     */
    public static final OfShort x$layout() {
        return x$LAYOUT;
    }

    private static final long x$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short x
     * }
     */
    public static final long x$offset() {
        return x$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short x
     * }
     */
    public static short x(MemorySegment union) {
        return union.get(x$LAYOUT, x$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short x
     * }
     */
    public static void x(MemorySegment union, short fieldValue) {
        union.set(x$LAYOUT, x$OFFSET, fieldValue);
    }

    private static final OfShort y$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("y"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short y
     * }
     */
    public static final OfShort y$layout() {
        return y$LAYOUT;
    }

    private static final long y$OFFSET = 2;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short y
     * }
     */
    public static final long y$offset() {
        return y$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short y
     * }
     */
    public static short y(MemorySegment union) {
        return union.get(y$LAYOUT, y$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short y
     * }
     */
    public static void y(MemorySegment union, short fieldValue) {
        union.set(y$LAYOUT, y$OFFSET, fieldValue);
    }

    private static final OfShort z$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("z"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short z
     * }
     */
    public static final OfShort z$layout() {
        return z$LAYOUT;
    }

    private static final long z$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short z
     * }
     */
    public static final long z$offset() {
        return z$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short z
     * }
     */
    public static short z(MemorySegment union) {
        return union.get(z$LAYOUT, z$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short z
     * }
     */
    public static void z(MemorySegment union, short fieldValue) {
        union.set(z$LAYOUT, z$OFFSET, fieldValue);
    }

    private static final OfShort w$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("w"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short w
     * }
     */
    public static final OfShort w$layout() {
        return w$LAYOUT;
    }

    private static final long w$OFFSET = 6;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short w
     * }
     */
    public static final long w$offset() {
        return w$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short w
     * }
     */
    public static short w(MemorySegment union) {
        return union.get(w$LAYOUT, w$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short w
     * }
     */
    public static void w(MemorySegment union, short fieldValue) {
        union.set(w$LAYOUT, w$OFFSET, fieldValue);
    }

    private static final OfShort __spacer4$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("__spacer4"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short __spacer4
     * }
     */
    public static final OfShort __spacer4$layout() {
        return __spacer4$LAYOUT;
    }

    private static final long __spacer4$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short __spacer4
     * }
     */
    public static final long __spacer4$offset() {
        return __spacer4$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short __spacer4
     * }
     */
    public static short __spacer4(MemorySegment union) {
        return union.get(__spacer4$LAYOUT, __spacer4$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short __spacer4
     * }
     */
    public static void __spacer4(MemorySegment union, short fieldValue) {
        union.set(__spacer4$LAYOUT, __spacer4$OFFSET, fieldValue);
    }

    private static final OfShort __spacer5$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("__spacer5"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short __spacer5
     * }
     */
    public static final OfShort __spacer5$layout() {
        return __spacer5$LAYOUT;
    }

    private static final long __spacer5$OFFSET = 10;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short __spacer5
     * }
     */
    public static final long __spacer5$offset() {
        return __spacer5$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short __spacer5
     * }
     */
    public static short __spacer5(MemorySegment union) {
        return union.get(__spacer5$LAYOUT, __spacer5$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short __spacer5
     * }
     */
    public static void __spacer5(MemorySegment union, short fieldValue) {
        union.set(__spacer5$LAYOUT, __spacer5$OFFSET, fieldValue);
    }

    private static final OfShort __spacer6$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("__spacer6"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short __spacer6
     * }
     */
    public static final OfShort __spacer6$layout() {
        return __spacer6$LAYOUT;
    }

    private static final long __spacer6$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short __spacer6
     * }
     */
    public static final long __spacer6$offset() {
        return __spacer6$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short __spacer6
     * }
     */
    public static short __spacer6(MemorySegment union) {
        return union.get(__spacer6$LAYOUT, __spacer6$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short __spacer6
     * }
     */
    public static void __spacer6(MemorySegment union, short fieldValue) {
        union.set(__spacer6$LAYOUT, __spacer6$OFFSET, fieldValue);
    }

    private static final OfShort __spacer7$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("__spacer7"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short __spacer7
     * }
     */
    public static final OfShort __spacer7$layout() {
        return __spacer7$LAYOUT;
    }

    private static final long __spacer7$OFFSET = 14;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short __spacer7
     * }
     */
    public static final long __spacer7$offset() {
        return __spacer7$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short __spacer7
     * }
     */
    public static short __spacer7(MemorySegment union) {
        return union.get(__spacer7$LAYOUT, __spacer7$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short __spacer7
     * }
     */
    public static void __spacer7(MemorySegment union, short fieldValue) {
        union.set(__spacer7$LAYOUT, __spacer7$OFFSET, fieldValue);
    }

    private static final OfShort __spacer8$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("__spacer8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short __spacer8
     * }
     */
    public static final OfShort __spacer8$layout() {
        return __spacer8$LAYOUT;
    }

    private static final long __spacer8$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short __spacer8
     * }
     */
    public static final long __spacer8$offset() {
        return __spacer8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short __spacer8
     * }
     */
    public static short __spacer8(MemorySegment union) {
        return union.get(__spacer8$LAYOUT, __spacer8$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short __spacer8
     * }
     */
    public static void __spacer8(MemorySegment union, short fieldValue) {
        union.set(__spacer8$LAYOUT, __spacer8$OFFSET, fieldValue);
    }

    private static final OfShort __spacer9$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("__spacer9"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short __spacer9
     * }
     */
    public static final OfShort __spacer9$layout() {
        return __spacer9$LAYOUT;
    }

    private static final long __spacer9$OFFSET = 18;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short __spacer9
     * }
     */
    public static final long __spacer9$offset() {
        return __spacer9$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short __spacer9
     * }
     */
    public static short __spacer9(MemorySegment union) {
        return union.get(__spacer9$LAYOUT, __spacer9$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short __spacer9
     * }
     */
    public static void __spacer9(MemorySegment union, short fieldValue) {
        union.set(__spacer9$LAYOUT, __spacer9$OFFSET, fieldValue);
    }

    private static final OfShort sa$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("sa"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short sa
     * }
     */
    public static final OfShort sa$layout() {
        return sa$LAYOUT;
    }

    private static final long sa$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short sa
     * }
     */
    public static final long sa$offset() {
        return sa$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short sa
     * }
     */
    public static short sa(MemorySegment union) {
        return union.get(sa$LAYOUT, sa$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short sa
     * }
     */
    public static void sa(MemorySegment union, short fieldValue) {
        union.set(sa$LAYOUT, sa$OFFSET, fieldValue);
    }

    private static final OfShort sb$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("sb"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short sb
     * }
     */
    public static final OfShort sb$layout() {
        return sb$LAYOUT;
    }

    private static final long sb$OFFSET = 22;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short sb
     * }
     */
    public static final long sb$offset() {
        return sb$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short sb
     * }
     */
    public static short sb(MemorySegment union) {
        return union.get(sb$LAYOUT, sb$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short sb
     * }
     */
    public static void sb(MemorySegment union, short fieldValue) {
        union.set(sb$LAYOUT, sb$OFFSET, fieldValue);
    }

    private static final OfShort sc$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("sc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short sc
     * }
     */
    public static final OfShort sc$layout() {
        return sc$LAYOUT;
    }

    private static final long sc$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short sc
     * }
     */
    public static final long sc$offset() {
        return sc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short sc
     * }
     */
    public static short sc(MemorySegment union) {
        return union.get(sc$LAYOUT, sc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short sc
     * }
     */
    public static void sc(MemorySegment union, short fieldValue) {
        union.set(sc$LAYOUT, sc$OFFSET, fieldValue);
    }

    private static final OfShort sd$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("sd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short sd
     * }
     */
    public static final OfShort sd$layout() {
        return sd$LAYOUT;
    }

    private static final long sd$OFFSET = 26;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short sd
     * }
     */
    public static final long sd$offset() {
        return sd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short sd
     * }
     */
    public static short sd(MemorySegment union) {
        return union.get(sd$LAYOUT, sd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short sd
     * }
     */
    public static void sd(MemorySegment union, short fieldValue) {
        union.set(sd$LAYOUT, sd$OFFSET, fieldValue);
    }

    private static final OfShort se$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("se"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short se
     * }
     */
    public static final OfShort se$layout() {
        return se$LAYOUT;
    }

    private static final long se$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short se
     * }
     */
    public static final long se$offset() {
        return se$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short se
     * }
     */
    public static short se(MemorySegment union) {
        return union.get(se$LAYOUT, se$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short se
     * }
     */
    public static void se(MemorySegment union, short fieldValue) {
        union.set(se$LAYOUT, se$OFFSET, fieldValue);
    }

    private static final OfShort sf$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$763:23"), groupElement("sf"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short sf
     * }
     */
    public static final OfShort sf$layout() {
        return sf$LAYOUT;
    }

    private static final long sf$OFFSET = 30;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short sf
     * }
     */
    public static final long sf$offset() {
        return sf$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short sf
     * }
     */
    public static short sf(MemorySegment union) {
        return union.get(sf$LAYOUT, sf$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short sf
     * }
     */
    public static void sf(MemorySegment union, short fieldValue) {
        union.set(sf$LAYOUT, sf$OFFSET, fieldValue);
    }

    private static final OfShort s0$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("s0"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short s0
     * }
     */
    public static final OfShort s0$layout() {
        return s0$LAYOUT;
    }

    private static final long s0$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short s0
     * }
     */
    public static final long s0$offset() {
        return s0$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short s0
     * }
     */
    public static short s0(MemorySegment union) {
        return union.get(s0$LAYOUT, s0$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short s0
     * }
     */
    public static void s0(MemorySegment union, short fieldValue) {
        union.set(s0$LAYOUT, s0$OFFSET, fieldValue);
    }

    private static final OfShort s1$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("s1"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short s1
     * }
     */
    public static final OfShort s1$layout() {
        return s1$LAYOUT;
    }

    private static final long s1$OFFSET = 2;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short s1
     * }
     */
    public static final long s1$offset() {
        return s1$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short s1
     * }
     */
    public static short s1(MemorySegment union) {
        return union.get(s1$LAYOUT, s1$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short s1
     * }
     */
    public static void s1(MemorySegment union, short fieldValue) {
        union.set(s1$LAYOUT, s1$OFFSET, fieldValue);
    }

    private static final OfShort s2$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("s2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short s2
     * }
     */
    public static final OfShort s2$layout() {
        return s2$LAYOUT;
    }

    private static final long s2$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short s2
     * }
     */
    public static final long s2$offset() {
        return s2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short s2
     * }
     */
    public static short s2(MemorySegment union) {
        return union.get(s2$LAYOUT, s2$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short s2
     * }
     */
    public static void s2(MemorySegment union, short fieldValue) {
        union.set(s2$LAYOUT, s2$OFFSET, fieldValue);
    }

    private static final OfShort s3$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("s3"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short s3
     * }
     */
    public static final OfShort s3$layout() {
        return s3$LAYOUT;
    }

    private static final long s3$OFFSET = 6;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short s3
     * }
     */
    public static final long s3$offset() {
        return s3$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short s3
     * }
     */
    public static short s3(MemorySegment union) {
        return union.get(s3$LAYOUT, s3$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short s3
     * }
     */
    public static void s3(MemorySegment union, short fieldValue) {
        union.set(s3$LAYOUT, s3$OFFSET, fieldValue);
    }

    private static final OfShort s4$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("s4"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short s4
     * }
     */
    public static final OfShort s4$layout() {
        return s4$LAYOUT;
    }

    private static final long s4$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short s4
     * }
     */
    public static final long s4$offset() {
        return s4$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short s4
     * }
     */
    public static short s4(MemorySegment union) {
        return union.get(s4$LAYOUT, s4$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short s4
     * }
     */
    public static void s4(MemorySegment union, short fieldValue) {
        union.set(s4$LAYOUT, s4$OFFSET, fieldValue);
    }

    private static final OfShort s5$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("s5"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short s5
     * }
     */
    public static final OfShort s5$layout() {
        return s5$LAYOUT;
    }

    private static final long s5$OFFSET = 10;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short s5
     * }
     */
    public static final long s5$offset() {
        return s5$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short s5
     * }
     */
    public static short s5(MemorySegment union) {
        return union.get(s5$LAYOUT, s5$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short s5
     * }
     */
    public static void s5(MemorySegment union, short fieldValue) {
        union.set(s5$LAYOUT, s5$OFFSET, fieldValue);
    }

    private static final OfShort s6$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("s6"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short s6
     * }
     */
    public static final OfShort s6$layout() {
        return s6$LAYOUT;
    }

    private static final long s6$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short s6
     * }
     */
    public static final long s6$offset() {
        return s6$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short s6
     * }
     */
    public static short s6(MemorySegment union) {
        return union.get(s6$LAYOUT, s6$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short s6
     * }
     */
    public static void s6(MemorySegment union, short fieldValue) {
        union.set(s6$LAYOUT, s6$OFFSET, fieldValue);
    }

    private static final OfShort s7$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("s7"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short s7
     * }
     */
    public static final OfShort s7$layout() {
        return s7$LAYOUT;
    }

    private static final long s7$OFFSET = 14;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short s7
     * }
     */
    public static final long s7$offset() {
        return s7$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short s7
     * }
     */
    public static short s7(MemorySegment union) {
        return union.get(s7$LAYOUT, s7$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short s7
     * }
     */
    public static void s7(MemorySegment union, short fieldValue) {
        union.set(s7$LAYOUT, s7$OFFSET, fieldValue);
    }

    private static final OfShort s8$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("s8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short s8
     * }
     */
    public static final OfShort s8$layout() {
        return s8$LAYOUT;
    }

    private static final long s8$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short s8
     * }
     */
    public static final long s8$offset() {
        return s8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short s8
     * }
     */
    public static short s8(MemorySegment union) {
        return union.get(s8$LAYOUT, s8$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short s8
     * }
     */
    public static void s8(MemorySegment union, short fieldValue) {
        union.set(s8$LAYOUT, s8$OFFSET, fieldValue);
    }

    private static final OfShort s9$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("s9"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short s9
     * }
     */
    public static final OfShort s9$layout() {
        return s9$LAYOUT;
    }

    private static final long s9$OFFSET = 18;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short s9
     * }
     */
    public static final long s9$offset() {
        return s9$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short s9
     * }
     */
    public static short s9(MemorySegment union) {
        return union.get(s9$LAYOUT, s9$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short s9
     * }
     */
    public static void s9(MemorySegment union, short fieldValue) {
        union.set(s9$LAYOUT, s9$OFFSET, fieldValue);
    }

    private static final OfShort sA$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("sA"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short sA
     * }
     */
    public static final OfShort sA$layout() {
        return sA$LAYOUT;
    }

    private static final long sA$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short sA
     * }
     */
    public static final long sA$offset() {
        return sA$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short sA
     * }
     */
    public static short sA(MemorySegment union) {
        return union.get(sA$LAYOUT, sA$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short sA
     * }
     */
    public static void sA(MemorySegment union, short fieldValue) {
        union.set(sA$LAYOUT, sA$OFFSET, fieldValue);
    }

    private static final OfShort sB$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("sB"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short sB
     * }
     */
    public static final OfShort sB$layout() {
        return sB$LAYOUT;
    }

    private static final long sB$OFFSET = 22;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short sB
     * }
     */
    public static final long sB$offset() {
        return sB$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short sB
     * }
     */
    public static short sB(MemorySegment union) {
        return union.get(sB$LAYOUT, sB$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short sB
     * }
     */
    public static void sB(MemorySegment union, short fieldValue) {
        union.set(sB$LAYOUT, sB$OFFSET, fieldValue);
    }

    private static final OfShort sC$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("sC"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short sC
     * }
     */
    public static final OfShort sC$layout() {
        return sC$LAYOUT;
    }

    private static final long sC$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short sC
     * }
     */
    public static final long sC$offset() {
        return sC$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short sC
     * }
     */
    public static short sC(MemorySegment union) {
        return union.get(sC$LAYOUT, sC$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short sC
     * }
     */
    public static void sC(MemorySegment union, short fieldValue) {
        union.set(sC$LAYOUT, sC$OFFSET, fieldValue);
    }

    private static final OfShort sD$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("sD"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short sD
     * }
     */
    public static final OfShort sD$layout() {
        return sD$LAYOUT;
    }

    private static final long sD$OFFSET = 26;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short sD
     * }
     */
    public static final long sD$offset() {
        return sD$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short sD
     * }
     */
    public static short sD(MemorySegment union) {
        return union.get(sD$LAYOUT, sD$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short sD
     * }
     */
    public static void sD(MemorySegment union, short fieldValue) {
        union.set(sD$LAYOUT, sD$OFFSET, fieldValue);
    }

    private static final OfShort sE$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("sE"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short sE
     * }
     */
    public static final OfShort sE$layout() {
        return sE$LAYOUT;
    }

    private static final long sE$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short sE
     * }
     */
    public static final long sE$offset() {
        return sE$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short sE
     * }
     */
    public static short sE(MemorySegment union) {
        return union.get(sE$LAYOUT, sE$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short sE
     * }
     */
    public static void sE(MemorySegment union, short fieldValue) {
        union.set(sE$LAYOUT, sE$OFFSET, fieldValue);
    }

    private static final OfShort sF$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$764:23"), groupElement("sF"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short sF
     * }
     */
    public static final OfShort sF$layout() {
        return sF$LAYOUT;
    }

    private static final long sF$OFFSET = 30;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short sF
     * }
     */
    public static final long sF$offset() {
        return sF$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short sF
     * }
     */
    public static short sF(MemorySegment union) {
        return union.get(sF$LAYOUT, sF$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short sF
     * }
     */
    public static void sF(MemorySegment union, short fieldValue) {
        union.set(sF$LAYOUT, sF$OFFSET, fieldValue);
    }

    private static final GroupLayout lo$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$765:23"), groupElement("lo"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short8 lo
     * }
     */
    public static final GroupLayout lo$layout() {
        return lo$LAYOUT;
    }

    private static final long lo$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short8 lo
     * }
     */
    public static final long lo$offset() {
        return lo$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short8 lo
     * }
     */
    public static MemorySegment lo(MemorySegment union) {
        return union.asSlice(lo$OFFSET, lo$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short8 lo
     * }
     */
    public static void lo(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, lo$OFFSET, lo$LAYOUT.byteSize());
    }

    private static final GroupLayout hi$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$765:23"), groupElement("hi"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_short8 hi
     * }
     */
    public static final GroupLayout hi$layout() {
        return hi$LAYOUT;
    }

    private static final long hi$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_short8 hi
     * }
     */
    public static final long hi$offset() {
        return hi$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_short8 hi
     * }
     */
    public static MemorySegment hi(MemorySegment union) {
        return union.asSlice(hi$OFFSET, hi$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_short8 hi
     * }
     */
    public static void hi(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, hi$OFFSET, hi$LAYOUT.byteSize());
    }

    private static final SequenceLayout v4$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("v4"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __cl_short4 v4[4]
     * }
     */
    public static final SequenceLayout v4$layout() {
        return v4$LAYOUT;
    }

    private static final long v4$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __cl_short4 v4[4]
     * }
     */
    public static final long v4$offset() {
        return v4$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __cl_short4 v4[4]
     * }
     */
    public static MemorySegment v4(MemorySegment union) {
        return union.asSlice(v4$OFFSET, v4$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __cl_short4 v4[4]
     * }
     */
    public static void v4(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, v4$OFFSET, v4$LAYOUT.byteSize());
    }

    private static long[] v4$DIMS = { 4 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __cl_short4 v4[4]
     * }
     */
    public static long[] v4$dimensions() {
        return v4$DIMS;
    }
    private static final VarHandle v4$ELEM_HANDLE = v4$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __cl_short4 v4[4]
     * }
     */
    public static MemorySegment v4(MemorySegment union, long index0) {
        return (MemorySegment)v4$ELEM_HANDLE.get(union, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __cl_short4 v4[4]
     * }
     */
    public static void v4(MemorySegment union, long index0, MemorySegment fieldValue) {
        v4$ELEM_HANDLE.set(union, 0L, index0, fieldValue);
    }

    private static final SequenceLayout v8$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("v8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __cl_short8 v8[2]
     * }
     */
    public static final SequenceLayout v8$layout() {
        return v8$LAYOUT;
    }

    private static final long v8$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __cl_short8 v8[2]
     * }
     */
    public static final long v8$offset() {
        return v8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __cl_short8 v8[2]
     * }
     */
    public static MemorySegment v8(MemorySegment union) {
        return union.asSlice(v8$OFFSET, v8$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __cl_short8 v8[2]
     * }
     */
    public static void v8(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, v8$OFFSET, v8$LAYOUT.byteSize());
    }

    private static long[] v8$DIMS = { 2 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __cl_short8 v8[2]
     * }
     */
    public static long[] v8$dimensions() {
        return v8$DIMS;
    }
