// Generated by jextract

package com.github.teruteru128.preview.opencl;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * union {
 *     cl_ulong s[16];
 *     struct {
 *         cl_ulong x;
 *         cl_ulong y;
 *         cl_ulong z;
 *         cl_ulong w;
 *         cl_ulong __spacer4;
 *         cl_ulong __spacer5;
 *         cl_ulong __spacer6;
 *         cl_ulong __spacer7;
 *         cl_ulong __spacer8;
 *         cl_ulong __spacer9;
 *         cl_ulong sa;
 *         cl_ulong sb;
 *         cl_ulong sc;
 *         cl_ulong sd;
 *         cl_ulong se;
 *         cl_ulong sf;
 *     };
 *     struct {
 *         cl_ulong s0;
 *         cl_ulong s1;
 *         cl_ulong s2;
 *         cl_ulong s3;
 *         cl_ulong s4;
 *         cl_ulong s5;
 *         cl_ulong s6;
 *         cl_ulong s7;
 *         cl_ulong s8;
 *         cl_ulong s9;
 *         cl_ulong sA;
 *         cl_ulong sB;
 *         cl_ulong sC;
 *         cl_ulong sD;
 *         cl_ulong sE;
 *         cl_ulong sF;
 *     };
 *     struct {
 *         cl_ulong8 lo;
 *         cl_ulong8 hi;
 *     };
 *     __cl_ulong2 v2[8];
 * }
 * }
 */
public class cl_ulong16 {

    cl_ulong16() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
        MemoryLayout.sequenceLayout(16, opencl_h.C_LONG_LONG).withName("s"),
        MemoryLayout.structLayout(
            opencl_h.C_LONG_LONG.withName("x"),
            opencl_h.C_LONG_LONG.withName("y"),
            opencl_h.C_LONG_LONG.withName("z"),
            opencl_h.C_LONG_LONG.withName("w"),
            opencl_h.C_LONG_LONG.withName("__spacer4"),
            opencl_h.C_LONG_LONG.withName("__spacer5"),
            opencl_h.C_LONG_LONG.withName("__spacer6"),
            opencl_h.C_LONG_LONG.withName("__spacer7"),
            opencl_h.C_LONG_LONG.withName("__spacer8"),
            opencl_h.C_LONG_LONG.withName("__spacer9"),
            opencl_h.C_LONG_LONG.withName("sa"),
            opencl_h.C_LONG_LONG.withName("sb"),
            opencl_h.C_LONG_LONG.withName("sc"),
            opencl_h.C_LONG_LONG.withName("sd"),
            opencl_h.C_LONG_LONG.withName("se"),
            opencl_h.C_LONG_LONG.withName("sf")
        ).withName("$anon$1211:23"),
        MemoryLayout.structLayout(
            opencl_h.C_LONG_LONG.withName("s0"),
            opencl_h.C_LONG_LONG.withName("s1"),
            opencl_h.C_LONG_LONG.withName("s2"),
            opencl_h.C_LONG_LONG.withName("s3"),
            opencl_h.C_LONG_LONG.withName("s4"),
            opencl_h.C_LONG_LONG.withName("s5"),
            opencl_h.C_LONG_LONG.withName("s6"),
            opencl_h.C_LONG_LONG.withName("s7"),
            opencl_h.C_LONG_LONG.withName("s8"),
            opencl_h.C_LONG_LONG.withName("s9"),
            opencl_h.C_LONG_LONG.withName("sA"),
            opencl_h.C_LONG_LONG.withName("sB"),
            opencl_h.C_LONG_LONG.withName("sC"),
            opencl_h.C_LONG_LONG.withName("sD"),
            opencl_h.C_LONG_LONG.withName("sE"),
            opencl_h.C_LONG_LONG.withName("sF")
        ).withName("$anon$1212:23"),
        MemoryLayout.structLayout(
            cl_ulong8.layout().withName("lo"),
            cl_ulong8.layout().withName("hi")
        ).withName("$anon$1213:23"),
        MemoryLayout.sequenceLayout(8, MemoryLayout.sequenceLayout(2, opencl_h.C_LONG_LONG)).withName("v2")
    ).withName("$anon$1207:9");

    /**
     * The layout of this union
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final SequenceLayout s$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("s"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong s[16]
     * }
     */
    public static final SequenceLayout s$layout() {
        return s$LAYOUT;
    }

    private static final long s$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong s[16]
     * }
     */
    public static final long s$offset() {
        return s$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong s[16]
     * }
     */
    public static MemorySegment s(MemorySegment union) {
        return union.asSlice(s$OFFSET, s$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong s[16]
     * }
     */
    public static void s(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, s$OFFSET, s$LAYOUT.byteSize());
    }

    private static long[] s$DIMS = { 16 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * cl_ulong s[16]
     * }
     */
    public static long[] s$dimensions() {
        return s$DIMS;
    }
    private static final VarHandle s$ELEM_HANDLE = s$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * cl_ulong s[16]
     * }
     */
    public static long s(MemorySegment union, long index0) {
        return (long)s$ELEM_HANDLE.get(union, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * cl_ulong s[16]
     * }
     */
    public static void s(MemorySegment union, long index0, long fieldValue) {
        s$ELEM_HANDLE.set(union, 0L, index0, fieldValue);
    }

    private static final OfLong x$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("x"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong x
     * }
     */
    public static final OfLong x$layout() {
        return x$LAYOUT;
    }

    private static final long x$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong x
     * }
     */
    public static final long x$offset() {
        return x$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong x
     * }
     */
    public static long x(MemorySegment union) {
        return union.get(x$LAYOUT, x$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong x
     * }
     */
    public static void x(MemorySegment union, long fieldValue) {
        union.set(x$LAYOUT, x$OFFSET, fieldValue);
    }

    private static final OfLong y$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("y"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong y
     * }
     */
    public static final OfLong y$layout() {
        return y$LAYOUT;
    }

    private static final long y$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong y
     * }
     */
    public static final long y$offset() {
        return y$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong y
     * }
     */
    public static long y(MemorySegment union) {
        return union.get(y$LAYOUT, y$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong y
     * }
     */
    public static void y(MemorySegment union, long fieldValue) {
        union.set(y$LAYOUT, y$OFFSET, fieldValue);
    }

    private static final OfLong z$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("z"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong z
     * }
     */
    public static final OfLong z$layout() {
        return z$LAYOUT;
    }

    private static final long z$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong z
     * }
     */
    public static final long z$offset() {
        return z$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong z
     * }
     */
    public static long z(MemorySegment union) {
        return union.get(z$LAYOUT, z$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong z
     * }
     */
    public static void z(MemorySegment union, long fieldValue) {
        union.set(z$LAYOUT, z$OFFSET, fieldValue);
    }

    private static final OfLong w$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("w"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong w
     * }
     */
    public static final OfLong w$layout() {
        return w$LAYOUT;
    }

    private static final long w$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong w
     * }
     */
    public static final long w$offset() {
        return w$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong w
     * }
     */
    public static long w(MemorySegment union) {
        return union.get(w$LAYOUT, w$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong w
     * }
     */
    public static void w(MemorySegment union, long fieldValue) {
        union.set(w$LAYOUT, w$OFFSET, fieldValue);
    }

    private static final OfLong __spacer4$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("__spacer4"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong __spacer4
     * }
     */
    public static final OfLong __spacer4$layout() {
        return __spacer4$LAYOUT;
    }

    private static final long __spacer4$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong __spacer4
     * }
     */
    public static final long __spacer4$offset() {
        return __spacer4$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong __spacer4
     * }
     */
    public static long __spacer4(MemorySegment union) {
        return union.get(__spacer4$LAYOUT, __spacer4$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong __spacer4
     * }
     */
    public static void __spacer4(MemorySegment union, long fieldValue) {
        union.set(__spacer4$LAYOUT, __spacer4$OFFSET, fieldValue);
    }

    private static final OfLong __spacer5$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("__spacer5"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong __spacer5
     * }
     */
    public static final OfLong __spacer5$layout() {
        return __spacer5$LAYOUT;
    }

    private static final long __spacer5$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong __spacer5
     * }
     */
    public static final long __spacer5$offset() {
        return __spacer5$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong __spacer5
     * }
     */
    public static long __spacer5(MemorySegment union) {
        return union.get(__spacer5$LAYOUT, __spacer5$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong __spacer5
     * }
     */
    public static void __spacer5(MemorySegment union, long fieldValue) {
        union.set(__spacer5$LAYOUT, __spacer5$OFFSET, fieldValue);
    }

    private static final OfLong __spacer6$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("__spacer6"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong __spacer6
     * }
     */
    public static final OfLong __spacer6$layout() {
        return __spacer6$LAYOUT;
    }

    private static final long __spacer6$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong __spacer6
     * }
     */
    public static final long __spacer6$offset() {
        return __spacer6$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong __spacer6
     * }
     */
    public static long __spacer6(MemorySegment union) {
        return union.get(__spacer6$LAYOUT, __spacer6$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong __spacer6
     * }
     */
    public static void __spacer6(MemorySegment union, long fieldValue) {
        union.set(__spacer6$LAYOUT, __spacer6$OFFSET, fieldValue);
    }

    private static final OfLong __spacer7$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("__spacer7"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong __spacer7
     * }
     */
    public static final OfLong __spacer7$layout() {
        return __spacer7$LAYOUT;
    }

    private static final long __spacer7$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong __spacer7
     * }
     */
    public static final long __spacer7$offset() {
        return __spacer7$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong __spacer7
     * }
     */
    public static long __spacer7(MemorySegment union) {
        return union.get(__spacer7$LAYOUT, __spacer7$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong __spacer7
     * }
     */
    public static void __spacer7(MemorySegment union, long fieldValue) {
        union.set(__spacer7$LAYOUT, __spacer7$OFFSET, fieldValue);
    }

    private static final OfLong __spacer8$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("__spacer8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong __spacer8
     * }
     */
    public static final OfLong __spacer8$layout() {
        return __spacer8$LAYOUT;
    }

    private static final long __spacer8$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong __spacer8
     * }
     */
    public static final long __spacer8$offset() {
        return __spacer8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong __spacer8
     * }
     */
    public static long __spacer8(MemorySegment union) {
        return union.get(__spacer8$LAYOUT, __spacer8$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong __spacer8
     * }
     */
    public static void __spacer8(MemorySegment union, long fieldValue) {
        union.set(__spacer8$LAYOUT, __spacer8$OFFSET, fieldValue);
    }

    private static final OfLong __spacer9$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("__spacer9"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong __spacer9
     * }
     */
    public static final OfLong __spacer9$layout() {
        return __spacer9$LAYOUT;
    }

    private static final long __spacer9$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong __spacer9
     * }
     */
    public static final long __spacer9$offset() {
        return __spacer9$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong __spacer9
     * }
     */
    public static long __spacer9(MemorySegment union) {
        return union.get(__spacer9$LAYOUT, __spacer9$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong __spacer9
     * }
     */
    public static void __spacer9(MemorySegment union, long fieldValue) {
        union.set(__spacer9$LAYOUT, __spacer9$OFFSET, fieldValue);
    }

    private static final OfLong sa$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("sa"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong sa
     * }
     */
    public static final OfLong sa$layout() {
        return sa$LAYOUT;
    }

    private static final long sa$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong sa
     * }
     */
    public static final long sa$offset() {
        return sa$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong sa
     * }
     */
    public static long sa(MemorySegment union) {
        return union.get(sa$LAYOUT, sa$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong sa
     * }
     */
    public static void sa(MemorySegment union, long fieldValue) {
        union.set(sa$LAYOUT, sa$OFFSET, fieldValue);
    }

    private static final OfLong sb$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("sb"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong sb
     * }
     */
    public static final OfLong sb$layout() {
        return sb$LAYOUT;
    }

    private static final long sb$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong sb
     * }
     */
    public static final long sb$offset() {
        return sb$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong sb
     * }
     */
    public static long sb(MemorySegment union) {
        return union.get(sb$LAYOUT, sb$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong sb
     * }
     */
    public static void sb(MemorySegment union, long fieldValue) {
        union.set(sb$LAYOUT, sb$OFFSET, fieldValue);
    }

    private static final OfLong sc$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("sc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong sc
     * }
     */
    public static final OfLong sc$layout() {
        return sc$LAYOUT;
    }

    private static final long sc$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong sc
     * }
     */
    public static final long sc$offset() {
        return sc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong sc
     * }
     */
    public static long sc(MemorySegment union) {
        return union.get(sc$LAYOUT, sc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong sc
     * }
     */
    public static void sc(MemorySegment union, long fieldValue) {
        union.set(sc$LAYOUT, sc$OFFSET, fieldValue);
    }

    private static final OfLong sd$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("sd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong sd
     * }
     */
    public static final OfLong sd$layout() {
        return sd$LAYOUT;
    }

    private static final long sd$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong sd
     * }
     */
    public static final long sd$offset() {
        return sd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong sd
     * }
     */
    public static long sd(MemorySegment union) {
        return union.get(sd$LAYOUT, sd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong sd
     * }
     */
    public static void sd(MemorySegment union, long fieldValue) {
        union.set(sd$LAYOUT, sd$OFFSET, fieldValue);
    }

    private static final OfLong se$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("se"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong se
     * }
     */
    public static final OfLong se$layout() {
        return se$LAYOUT;
    }

    private static final long se$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong se
     * }
     */
    public static final long se$offset() {
        return se$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong se
     * }
     */
    public static long se(MemorySegment union) {
        return union.get(se$LAYOUT, se$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong se
     * }
     */
    public static void se(MemorySegment union, long fieldValue) {
        union.set(se$LAYOUT, se$OFFSET, fieldValue);
    }

    private static final OfLong sf$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1211:23"), groupElement("sf"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong sf
     * }
     */
    public static final OfLong sf$layout() {
        return sf$LAYOUT;
    }

    private static final long sf$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong sf
     * }
     */
    public static final long sf$offset() {
        return sf$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong sf
     * }
     */
    public static long sf(MemorySegment union) {
        return union.get(sf$LAYOUT, sf$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong sf
     * }
     */
    public static void sf(MemorySegment union, long fieldValue) {
        union.set(sf$LAYOUT, sf$OFFSET, fieldValue);
    }

    private static final OfLong s0$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("s0"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong s0
     * }
     */
    public static final OfLong s0$layout() {
        return s0$LAYOUT;
    }

    private static final long s0$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong s0
     * }
     */
    public static final long s0$offset() {
        return s0$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong s0
     * }
     */
    public static long s0(MemorySegment union) {
        return union.get(s0$LAYOUT, s0$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong s0
     * }
     */
    public static void s0(MemorySegment union, long fieldValue) {
        union.set(s0$LAYOUT, s0$OFFSET, fieldValue);
    }

    private static final OfLong s1$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("s1"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong s1
     * }
     */
    public static final OfLong s1$layout() {
        return s1$LAYOUT;
    }

    private static final long s1$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong s1
     * }
     */
    public static final long s1$offset() {
        return s1$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong s1
     * }
     */
    public static long s1(MemorySegment union) {
        return union.get(s1$LAYOUT, s1$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong s1
     * }
     */
    public static void s1(MemorySegment union, long fieldValue) {
        union.set(s1$LAYOUT, s1$OFFSET, fieldValue);
    }

    private static final OfLong s2$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("s2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong s2
     * }
     */
    public static final OfLong s2$layout() {
        return s2$LAYOUT;
    }

    private static final long s2$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong s2
     * }
     */
    public static final long s2$offset() {
        return s2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong s2
     * }
     */
    public static long s2(MemorySegment union) {
        return union.get(s2$LAYOUT, s2$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong s2
     * }
     */
    public static void s2(MemorySegment union, long fieldValue) {
        union.set(s2$LAYOUT, s2$OFFSET, fieldValue);
    }

    private static final OfLong s3$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("s3"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong s3
     * }
     */
    public static final OfLong s3$layout() {
        return s3$LAYOUT;
    }

    private static final long s3$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong s3
     * }
     */
    public static final long s3$offset() {
        return s3$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong s3
     * }
     */
    public static long s3(MemorySegment union) {
        return union.get(s3$LAYOUT, s3$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong s3
     * }
     */
    public static void s3(MemorySegment union, long fieldValue) {
        union.set(s3$LAYOUT, s3$OFFSET, fieldValue);
    }

    private static final OfLong s4$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("s4"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong s4
     * }
     */
    public static final OfLong s4$layout() {
        return s4$LAYOUT;
    }

    private static final long s4$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong s4
     * }
     */
    public static final long s4$offset() {
        return s4$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong s4
     * }
     */
    public static long s4(MemorySegment union) {
        return union.get(s4$LAYOUT, s4$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong s4
     * }
     */
    public static void s4(MemorySegment union, long fieldValue) {
        union.set(s4$LAYOUT, s4$OFFSET, fieldValue);
    }

    private static final OfLong s5$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("s5"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong s5
     * }
     */
    public static final OfLong s5$layout() {
        return s5$LAYOUT;
    }

    private static final long s5$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong s5
     * }
     */
    public static final long s5$offset() {
        return s5$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong s5
     * }
     */
    public static long s5(MemorySegment union) {
        return union.get(s5$LAYOUT, s5$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong s5
     * }
     */
    public static void s5(MemorySegment union, long fieldValue) {
        union.set(s5$LAYOUT, s5$OFFSET, fieldValue);
    }

    private static final OfLong s6$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("s6"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong s6
     * }
     */
    public static final OfLong s6$layout() {
        return s6$LAYOUT;
    }

    private static final long s6$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong s6
     * }
     */
    public static final long s6$offset() {
        return s6$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong s6
     * }
     */
    public static long s6(MemorySegment union) {
        return union.get(s6$LAYOUT, s6$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong s6
     * }
     */
    public static void s6(MemorySegment union, long fieldValue) {
        union.set(s6$LAYOUT, s6$OFFSET, fieldValue);
    }

    private static final OfLong s7$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("s7"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong s7
     * }
     */
    public static final OfLong s7$layout() {
        return s7$LAYOUT;
    }

    private static final long s7$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong s7
     * }
     */
    public static final long s7$offset() {
        return s7$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong s7
     * }
     */
    public static long s7(MemorySegment union) {
        return union.get(s7$LAYOUT, s7$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong s7
     * }
     */
    public static void s7(MemorySegment union, long fieldValue) {
        union.set(s7$LAYOUT, s7$OFFSET, fieldValue);
    }

    private static final OfLong s8$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("s8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong s8
     * }
     */
    public static final OfLong s8$layout() {
        return s8$LAYOUT;
    }

    private static final long s8$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong s8
     * }
     */
    public static final long s8$offset() {
        return s8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong s8
     * }
     */
    public static long s8(MemorySegment union) {
        return union.get(s8$LAYOUT, s8$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong s8
     * }
     */
    public static void s8(MemorySegment union, long fieldValue) {
        union.set(s8$LAYOUT, s8$OFFSET, fieldValue);
    }

    private static final OfLong s9$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("s9"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong s9
     * }
     */
    public static final OfLong s9$layout() {
        return s9$LAYOUT;
    }

    private static final long s9$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong s9
     * }
     */
    public static final long s9$offset() {
        return s9$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong s9
     * }
     */
    public static long s9(MemorySegment union) {
        return union.get(s9$LAYOUT, s9$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong s9
     * }
     */
    public static void s9(MemorySegment union, long fieldValue) {
        union.set(s9$LAYOUT, s9$OFFSET, fieldValue);
    }

    private static final OfLong sA$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("sA"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong sA
     * }
     */
    public static final OfLong sA$layout() {
        return sA$LAYOUT;
    }

    private static final long sA$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong sA
     * }
     */
    public static final long sA$offset() {
        return sA$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong sA
     * }
     */
    public static long sA(MemorySegment union) {
        return union.get(sA$LAYOUT, sA$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong sA
     * }
     */
    public static void sA(MemorySegment union, long fieldValue) {
        union.set(sA$LAYOUT, sA$OFFSET, fieldValue);
    }

    private static final OfLong sB$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("sB"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong sB
     * }
     */
    public static final OfLong sB$layout() {
        return sB$LAYOUT;
    }

    private static final long sB$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong sB
     * }
     */
    public static final long sB$offset() {
        return sB$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong sB
     * }
     */
    public static long sB(MemorySegment union) {
        return union.get(sB$LAYOUT, sB$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong sB
     * }
     */
    public static void sB(MemorySegment union, long fieldValue) {
        union.set(sB$LAYOUT, sB$OFFSET, fieldValue);
    }

    private static final OfLong sC$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("sC"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong sC
     * }
     */
    public static final OfLong sC$layout() {
        return sC$LAYOUT;
    }

    private static final long sC$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong sC
     * }
     */
    public static final long sC$offset() {
        return sC$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong sC
     * }
     */
    public static long sC(MemorySegment union) {
        return union.get(sC$LAYOUT, sC$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong sC
     * }
     */
    public static void sC(MemorySegment union, long fieldValue) {
        union.set(sC$LAYOUT, sC$OFFSET, fieldValue);
    }

    private static final OfLong sD$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("sD"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong sD
     * }
     */
    public static final OfLong sD$layout() {
        return sD$LAYOUT;
    }

    private static final long sD$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong sD
     * }
     */
    public static final long sD$offset() {
        return sD$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong sD
     * }
     */
    public static long sD(MemorySegment union) {
        return union.get(sD$LAYOUT, sD$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong sD
     * }
     */
    public static void sD(MemorySegment union, long fieldValue) {
        union.set(sD$LAYOUT, sD$OFFSET, fieldValue);
    }

    private static final OfLong sE$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("sE"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong sE
     * }
     */
    public static final OfLong sE$layout() {
        return sE$LAYOUT;
    }

    private static final long sE$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong sE
     * }
     */
    public static final long sE$offset() {
        return sE$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong sE
     * }
     */
    public static long sE(MemorySegment union) {
        return union.get(sE$LAYOUT, sE$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong sE
     * }
     */
    public static void sE(MemorySegment union, long fieldValue) {
        union.set(sE$LAYOUT, sE$OFFSET, fieldValue);
    }

    private static final OfLong sF$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$1212:23"), groupElement("sF"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong sF
     * }
     */
    public static final OfLong sF$layout() {
        return sF$LAYOUT;
    }

    private static final long sF$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong sF
     * }
     */
    public static final long sF$offset() {
        return sF$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong sF
     * }
     */
    public static long sF(MemorySegment union) {
        return union.get(sF$LAYOUT, sF$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong sF
     * }
     */
    public static void sF(MemorySegment union, long fieldValue) {
        union.set(sF$LAYOUT, sF$OFFSET, fieldValue);
    }

    private static final GroupLayout lo$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$1213:23"), groupElement("lo"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong8 lo
     * }
     */
    public static final GroupLayout lo$layout() {
        return lo$LAYOUT;
    }

    private static final long lo$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong8 lo
     * }
     */
    public static final long lo$offset() {
        return lo$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong8 lo
     * }
     */
    public static MemorySegment lo(MemorySegment union) {
        return union.asSlice(lo$OFFSET, lo$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong8 lo
     * }
     */
    public static void lo(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, lo$OFFSET, lo$LAYOUT.byteSize());
    }

    private static final GroupLayout hi$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$1213:23"), groupElement("hi"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cl_ulong8 hi
     * }
     */
    public static final GroupLayout hi$layout() {
        return hi$LAYOUT;
    }

    private static final long hi$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cl_ulong8 hi
     * }
     */
    public static final long hi$offset() {
        return hi$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cl_ulong8 hi
     * }
     */
    public static MemorySegment hi(MemorySegment union) {
        return union.asSlice(hi$OFFSET, hi$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cl_ulong8 hi
     * }
     */
    public static void hi(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, hi$OFFSET, hi$LAYOUT.byteSize());
    }

    private static final SequenceLayout v2$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("v2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __cl_ulong2 v2[8]
     * }
     */
    public static final SequenceLayout v2$layout() {
        return v2$LAYOUT;
    }

    private static final long v2$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __cl_ulong2 v2[8]
     * }
     */
    public static final long v2$offset() {
        return v2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __cl_ulong2 v2[8]
     * }
     */
    public static MemorySegment v2(MemorySegment union) {
        return union.asSlice(v2$OFFSET, v2$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __cl_ulong2 v2[8]
     * }
     */
    public static void v2(MemorySegment union, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, union, v2$OFFSET, v2$LAYOUT.byteSize());
    }

    private static long[] v2$DIMS = { 8 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __cl_ulong2 v2[8]
     * }
     */
    public static long[] v2$dimensions() {
        return v2$DIMS;
    }
