// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2080 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2080() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pCertInfo"),
        MemoryLayout.unionLayout(
            JAVA_LONG.withName("hCryptProv"),
            JAVA_LONG.withName("hNCryptKey")
        ).withName("$anon$0"),
        JAVA_INT.withName("dwKeySpec"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("HashAlgorithm"),
        RuntimeHelper.POINTER.withName("pvHashAuxInfo"),
        JAVA_INT.withName("cAuthAttr"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgAuthAttr"),
        JAVA_INT.withName("cUnauthAttr"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgUnauthAttr")
    ).withName("_CMSG_SIGNER_ENCODE_INFO");
    static final VarHandle const$1 = constants$2080.const$0.varHandle(MemoryLayout.PathElement.groupElement("cbSize"));
    static final VarHandle const$2 = constants$2080.const$0.varHandle(MemoryLayout.PathElement.groupElement("pCertInfo"));
    static final VarHandle const$3 = constants$2080.const$0.varHandle(MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("hCryptProv"));
    static final VarHandle const$4 = constants$2080.const$0.varHandle(MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("hNCryptKey"));
    static final VarHandle const$5 = constants$2080.const$0.varHandle(MemoryLayout.PathElement.groupElement("dwKeySpec"));
}


