// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2008 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2008() {}
    static final VarHandle const$0 = constants$2007.const$4.varHandle(MemoryLayout.PathElement.groupElement("rgRDN"));
    static final StructLayout const$1 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwValueType"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("Value")
    ).withName("_CERT_NAME_VALUE");
    static final VarHandle const$2 = constants$2008.const$1.varHandle(MemoryLayout.PathElement.groupElement("dwValueType"));
    static final StructLayout const$3 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("Algorithm"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData"),
            JAVA_INT.withName("cUnusedBits"),
            MemoryLayout.paddingLayout(4)
        ).withName("PublicKey")
    ).withName("_CERT_PUBLIC_KEY_INFO");
    static final StructLayout const$4 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwVersion"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("PrivateKey"),
        RuntimeHelper.POINTER.withName("szCurveOid"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData"),
            JAVA_INT.withName("cUnusedBits"),
            MemoryLayout.paddingLayout(4)
        ).withName("PublicKey")
    ).withName("_CRYPT_ECC_PRIVATE_KEY_INFO");
    static final VarHandle const$5 = constants$2008.const$4.varHandle(MemoryLayout.PathElement.groupElement("dwVersion"));
}


