// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2174 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2174() {}
    static final MethodHandle const$0 = RuntimeHelper.downcallHandle(
        "CertGetNameStringW",
        constants$1405.const$1
    );
    static final MethodHandle const$1 = RuntimeHelper.upcallHandle(PFN_CRYPT_GET_SIGNER_CERTIFICATE.class, "apply", constants$595.const$3);
    static final MethodHandle const$2 = RuntimeHelper.downcallHandle(
        constants$595.const$3
    );
    static final StructLayout const$3 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        JAVA_INT.withName("dwMsgEncodingType"),
        RuntimeHelper.POINTER.withName("pSigningCert"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("HashAlgorithm"),
        RuntimeHelper.POINTER.withName("pvHashAuxInfo"),
        JAVA_INT.withName("cMsgCert"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgpMsgCert"),
        JAVA_INT.withName("cMsgCrl"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgpMsgCrl"),
        JAVA_INT.withName("cAuthAttr"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgAuthAttr"),
        JAVA_INT.withName("cUnauthAttr"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgUnauthAttr"),
        JAVA_INT.withName("dwFlags"),
        JAVA_INT.withName("dwInnerContentType")
    ).withName("_CRYPT_SIGN_MESSAGE_PARA");
    static final VarHandle const$4 = constants$2174.const$3.varHandle(MemoryLayout.PathElement.groupElement("cbSize"));
    static final VarHandle const$5 = constants$2174.const$3.varHandle(MemoryLayout.PathElement.groupElement("dwMsgEncodingType"));
}


