// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2085 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2085() {}
    static final VarHandle const$0 = constants$2084.const$5.varHandle(MemoryLayout.PathElement.groupElement("cbSize"));
    static final VarHandle const$1 = constants$2084.const$5.varHandle(MemoryLayout.PathElement.groupElement("pOtherAttr"));
    static final StructLayout const$2 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("KeyEncryptionAlgorithm"),
        RuntimeHelper.POINTER.withName("pvKeyEncryptionAuxInfo"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("KeyWrapAlgorithm"),
        RuntimeHelper.POINTER.withName("pvKeyWrapAuxInfo"),
        JAVA_LONG.withName("hCryptProv"),
        JAVA_INT.withName("dwKeySpec"),
        JAVA_INT.withName("dwKeyChoice"),
        MemoryLayout.unionLayout(
            RuntimeHelper.POINTER.withName("pEphemeralAlgorithm"),
            RuntimeHelper.POINTER.withName("pSenderId")
        ).withName("$anon$0"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("UserKeyingMaterial"),
        JAVA_INT.withName("cRecipientEncryptedKeys"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgpRecipientEncryptedKeys")
    ).withName("_CMSG_KEY_AGREE_RECIPIENT_ENCODE_INFO");
    static final VarHandle const$3 = constants$2085.const$2.varHandle(MemoryLayout.PathElement.groupElement("cbSize"));
    static final VarHandle const$4 = constants$2085.const$2.varHandle(MemoryLayout.PathElement.groupElement("pvKeyEncryptionAuxInfo"));
    static final VarHandle const$5 = constants$2085.const$2.varHandle(MemoryLayout.PathElement.groupElement("pvKeyWrapAuxInfo"));
}


