// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$3440 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$3440() {}
    static final MethodHandle const$0 = RuntimeHelper.upcallHandle(tagEXCEPINFO.pfnDeferredFillIn.class, "apply", constants$18.const$5);
    static final VarHandle const$1 = constants$3438.const$4.varHandle(MemoryLayout.PathElement.groupElement("pfnDeferredFillIn"));
    static final VarHandle const$2 = constants$3438.const$4.varHandle(MemoryLayout.PathElement.groupElement("scode"));
    static final StructLayout const$3 = MemoryLayout.structLayout(
        JAVA_INT.withName("memid"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("lprgscode"),
        RuntimeHelper.POINTER.withName("lprgelemdescParam"),
        JAVA_INT.withName("funckind"),
        JAVA_INT.withName("invkind"),
        JAVA_INT.withName("callconv"),
        JAVA_SHORT.withName("cParams"),
        JAVA_SHORT.withName("cParamsOpt"),
        JAVA_SHORT.withName("oVft"),
        JAVA_SHORT.withName("cScodes"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                MemoryLayout.unionLayout(
                    RuntimeHelper.POINTER.withName("lptdesc"),
                    RuntimeHelper.POINTER.withName("lpadesc"),
                    JAVA_INT.withName("hreftype")
                ).withName("$anon$0"),
                JAVA_SHORT.withName("vt"),
                MemoryLayout.paddingLayout(6)
            ).withName("tdesc"),
            MemoryLayout.unionLayout(
                MemoryLayout.structLayout(
                    JAVA_LONG.withName("dwReserved"),
                    JAVA_SHORT.withName("wIDLFlags"),
                    MemoryLayout.paddingLayout(6)
                ).withName("idldesc"),
                MemoryLayout.structLayout(
                    RuntimeHelper.POINTER.withName("pparamdescex"),
                    JAVA_SHORT.withName("wParamFlags"),
                    MemoryLayout.paddingLayout(6)
                ).withName("paramdesc")
            ).withName("$anon$0")
        ).withName("elemdescFunc"),
        JAVA_SHORT.withName("wFuncFlags"),
        MemoryLayout.paddingLayout(6)
    ).withName("tagFUNCDESC");
    static final VarHandle const$4 = constants$3440.const$3.varHandle(MemoryLayout.PathElement.groupElement("memid"));
    static final VarHandle const$5 = constants$3440.const$3.varHandle(MemoryLayout.PathElement.groupElement("lprgscode"));
}


