// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2090 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2090() {}
    static final VarHandle const$0 = constants$2089.const$5.varHandle(MemoryLayout.PathElement.groupElement("cbSize"));
    static final VarHandle const$1 = constants$2089.const$5.varHandle(MemoryLayout.PathElement.groupElement("dwFlags"));
    static final StructLayout const$2 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        JAVA_INT.withName("dwBitLen")
    ).withName("_CMSG_RC4_AUX_INFO");
    static final VarHandle const$3 = constants$2090.const$2.varHandle(MemoryLayout.PathElement.groupElement("cbSize"));
    static final VarHandle const$4 = constants$2090.const$2.varHandle(MemoryLayout.PathElement.groupElement("dwBitLen"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbSize"),
            JAVA_INT.withName("cSigners"),
            RuntimeHelper.POINTER.withName("rgSigners"),
            JAVA_INT.withName("cCertEncoded"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("rgCertEncoded"),
            JAVA_INT.withName("cCrlEncoded"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("rgCrlEncoded")
        ).withName("SignedInfo"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbSize"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("hCryptProv"),
            MemoryLayout.structLayout(
                RuntimeHelper.POINTER.withName("pszObjId"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData")
                ).withName("Parameters")
            ).withName("ContentEncryptionAlgorithm"),
            RuntimeHelper.POINTER.withName("pvEncryptionAuxInfo"),
            JAVA_INT.withName("cRecipients"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("rgpRecipients")
        ).withName("EnvelopedInfo")
    ).withName("_CMSG_SIGNED_AND_ENVELOPED_ENCODE_INFO");
}


