// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2108 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2108() {}
    static final MethodHandle const$0 = RuntimeHelper.downcallHandle(
        constants$2107.const$4
    );
    static final FunctionDescriptor const$1 = FunctionDescriptor.of(JAVA_INT,
        JAVA_LONG,
        JAVA_INT,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        JAVA_INT,
        RuntimeHelper.POINTER
    );
    static final MethodHandle const$2 = RuntimeHelper.upcallHandle(PFN_CMSG_IMPORT_ENCRYPT_KEY.class, "apply", constants$2108.const$1);
    static final MethodHandle const$3 = RuntimeHelper.downcallHandle(
        constants$2108.const$1
    );
    static final StructLayout const$4 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        MemoryLayout.paddingLayout(4),
        JAVA_LONG.withName("hCryptProv"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("ContentEncryptionAlgorithm"),
        RuntimeHelper.POINTER.withName("pvEncryptionAuxInfo"),
        JAVA_INT.withName("cRecipients"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgCmsRecipients"),
        RuntimeHelper.POINTER.withName("pfnAlloc"),
        RuntimeHelper.POINTER.withName("pfnFree"),
        JAVA_INT.withName("dwEncryptFlags"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.unionLayout(
            JAVA_LONG.withName("hContentEncryptKey"),
            RuntimeHelper.POINTER.withName("hCNGContentEncryptKey")
        ).withName("$anon$0"),
        JAVA_INT.withName("dwFlags"),
        JAVA_INT.withName("fCNG"),
        RuntimeHelper.POINTER.withName("pbCNGContentEncryptKeyObject"),
        RuntimeHelper.POINTER.withName("pbContentEncryptKey"),
        JAVA_INT.withName("cbContentEncryptKey"),
        MemoryLayout.paddingLayout(4)
    ).withName("_CMSG_CONTENT_ENCRYPT_INFO");
    static final VarHandle const$5 = constants$2108.const$4.varHandle(MemoryLayout.PathElement.groupElement("cbSize"));
}


