// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$3595 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$3595() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        MemoryLayout.unionLayout(
            MemoryLayout.structLayout(
                JAVA_SHORT.withName("vt"),
                JAVA_SHORT.withName("wReserved1"),
                JAVA_SHORT.withName("wReserved2"),
                JAVA_SHORT.withName("wReserved3"),
                MemoryLayout.unionLayout(
                    JAVA_BYTE.withName("cVal"),
                    JAVA_BYTE.withName("bVal"),
                    JAVA_SHORT.withName("iVal"),
                    JAVA_SHORT.withName("uiVal"),
                    JAVA_INT.withName("lVal"),
                    JAVA_INT.withName("ulVal"),
                    JAVA_INT.withName("intVal"),
                    JAVA_INT.withName("uintVal"),
                    MemoryLayout.unionLayout(
                        MemoryLayout.structLayout(
                            JAVA_INT.withName("LowPart"),
                            JAVA_INT.withName("HighPart")
                        ).withName("$anon$0"),
                        MemoryLayout.structLayout(
                            JAVA_INT.withName("LowPart"),
                            JAVA_INT.withName("HighPart")
                        ).withName("u"),
                        JAVA_LONG.withName("QuadPart")
                    ).withName("hVal"),
                    MemoryLayout.unionLayout(
                        MemoryLayout.structLayout(
                            JAVA_INT.withName("LowPart"),
                            JAVA_INT.withName("HighPart")
                        ).withName("$anon$0"),
                        MemoryLayout.structLayout(
                            JAVA_INT.withName("LowPart"),
                            JAVA_INT.withName("HighPart")
                        ).withName("u"),
                        JAVA_LONG.withName("QuadPart")
                    ).withName("uhVal"),
                    JAVA_FLOAT.withName("fltVal"),
                    JAVA_DOUBLE.withName("dblVal"),
                    JAVA_SHORT.withName("boolVal"),
                    JAVA_SHORT.withName("__OBSOLETE__VARIANT_BOOL"),
                    JAVA_INT.withName("scode"),
                    MemoryLayout.unionLayout(
                        MemoryLayout.structLayout(
                            JAVA_INT.withName("Lo"),
                            JAVA_INT.withName("Hi")
                        ).withName("$anon$0"),
                        JAVA_LONG.withName("int64")
                    ).withName("cyVal"),
                    JAVA_DOUBLE.withName("date"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("dwLowDateTime"),
                        JAVA_INT.withName("dwHighDateTime")
                    ).withName("filetime"),
                    RuntimeHelper.POINTER.withName("puuid"),
                    RuntimeHelper.POINTER.withName("pclipdata"),
                    RuntimeHelper.POINTER.withName("bstrVal"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cbSize"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pData")
                    ).withName("bstrblobVal"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cbSize"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pBlobData")
                    ).withName("blob"),
                    RuntimeHelper.POINTER.withName("pszVal"),
                    RuntimeHelper.POINTER.withName("pwszVal"),
                    RuntimeHelper.POINTER.withName("punkVal"),
                    RuntimeHelper.POINTER.withName("pdispVal"),
                    RuntimeHelper.POINTER.withName("pStream"),
                    RuntimeHelper.POINTER.withName("pStorage"),
                    RuntimeHelper.POINTER.withName("pVersionedStream"),
                    RuntimeHelper.POINTER.withName("parray"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cac"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("caub"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cai"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("caui"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cal"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("caul"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cah"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cauh"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("caflt"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cadbl"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cabool"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cascode"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cacy"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cadate"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cafiletime"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cauuid"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("caclipdata"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cabstr"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("cabstrblob"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("calpstr"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("calpwstr"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cElems"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pElems")
                    ).withName("capropvar"),
                    RuntimeHelper.POINTER.withName("pcVal"),
                    RuntimeHelper.POINTER.withName("pbVal"),
                    RuntimeHelper.POINTER.withName("piVal"),
                    RuntimeHelper.POINTER.withName("puiVal"),
                    RuntimeHelper.POINTER.withName("plVal"),
                    RuntimeHelper.POINTER.withName("pulVal"),
                    RuntimeHelper.POINTER.withName("pintVal"),
                    RuntimeHelper.POINTER.withName("puintVal"),
                    RuntimeHelper.POINTER.withName("pfltVal"),
                    RuntimeHelper.POINTER.withName("pdblVal"),
                    RuntimeHelper.POINTER.withName("pboolVal"),
                    RuntimeHelper.POINTER.withName("pdecVal"),
                    RuntimeHelper.POINTER.withName("pscode"),
                    RuntimeHelper.POINTER.withName("pcyVal"),
                    RuntimeHelper.POINTER.withName("pdate"),
                    RuntimeHelper.POINTER.withName("pbstrVal"),
                    RuntimeHelper.POINTER.withName("ppunkVal"),
                    RuntimeHelper.POINTER.withName("ppdispVal"),
                    RuntimeHelper.POINTER.withName("pparray"),
                    RuntimeHelper.POINTER.withName("pvarVal")
                ).withName("$anon$0")
            ).withName("$anon$0"),
            MemoryLayout.structLayout(
                JAVA_SHORT.withName("wReserved"),
                MemoryLayout.unionLayout(
                    MemoryLayout.structLayout(
                        JAVA_BYTE.withName("scale"),
                        JAVA_BYTE.withName("sign")
                    ).withName("$anon$0"),
                    JAVA_SHORT.withName("signscale")
                ).withName("$anon$0"),
                JAVA_INT.withName("Hi32"),
                MemoryLayout.unionLayout(
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("Lo32"),
                        JAVA_INT.withName("Mid32")
                    ).withName("$anon$0"),
                    JAVA_LONG.withName("Lo64")
                ).withName("$anon$1")
            ).withName("decVal")
        ).withName("$anon$0")
    ).withName("tagPROPVARIANT");
    static final VarHandle const$1 = constants$3595.const$0.varHandle(MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("vt"));
    static final VarHandle const$2 = constants$3595.const$0.varHandle(MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("wReserved1"));
    static final VarHandle const$3 = constants$3595.const$0.varHandle(MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("wReserved2"));
    static final VarHandle const$4 = constants$3595.const$0.varHandle(MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("wReserved3"));
    static final VarHandle const$5 = constants$3595.const$0.varHandle(MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("cVal"));
}


