// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2038 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2038() {}
    static final VarHandle const$0 = constants$2037.const$5.varHandle(MemoryLayout.PathElement.groupElement("cAccDescr"));
    static final VarHandle const$1 = constants$2037.const$5.varHandle(MemoryLayout.PathElement.groupElement("rgAccDescr"));
    static final StructLayout const$2 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwDistPointNameChoice"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.unionLayout(
            MemoryLayout.structLayout(
                JAVA_INT.withName("cAltEntry"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("rgAltEntry")
            ).withName("FullName")
        ).withName("$anon$0")
    ).withName("_CRL_DIST_POINT_NAME");
    static final VarHandle const$3 = constants$2038.const$2.varHandle(MemoryLayout.PathElement.groupElement("dwDistPointNameChoice"));
    static final StructLayout const$4 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwDistPointNameChoice"),
            MemoryLayout.paddingLayout(4),
            MemoryLayout.unionLayout(
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cAltEntry"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("rgAltEntry")
                ).withName("FullName")
            ).withName("$anon$0")
        ).withName("DistPointName"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData"),
            JAVA_INT.withName("cUnusedBits"),
            MemoryLayout.paddingLayout(4)
        ).withName("ReasonFlags"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cAltEntry"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("rgAltEntry")
        ).withName("CRLIssuer")
    ).withName("_CRL_DIST_POINT");
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("cDistPoint"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgDistPoint")
    ).withName("_CRL_DIST_POINTS_INFO");
}


