// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2037 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2037() {}
    static final VarHandle const$0 = constants$2036.const$5.varHandle(MemoryLayout.PathElement.groupElement("cValue"));
    static final VarHandle const$1 = constants$2036.const$5.varHandle(MemoryLayout.PathElement.groupElement("rgValue"));
    static final StructLayout const$2 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("KeyId"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cAltEntry"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("rgAltEntry")
        ).withName("AuthorityCertIssuer"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("AuthorityCertSerialNumber")
    ).withName("_CERT_AUTHORITY_KEY_ID2_INFO");
    static final StructLayout const$3 = MemoryLayout.structLayout(
        RuntimeHelper.POINTER.withName("pszAccessMethod"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwAltNameChoice"),
            MemoryLayout.paddingLayout(4),
            MemoryLayout.unionLayout(
                RuntimeHelper.POINTER.withName("pOtherName"),
                RuntimeHelper.POINTER.withName("pwszRfc822Name"),
                RuntimeHelper.POINTER.withName("pwszDNSName"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData")
                ).withName("DirectoryName"),
                RuntimeHelper.POINTER.withName("pwszURL"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData")
                ).withName("IPAddress"),
                RuntimeHelper.POINTER.withName("pszRegisteredID")
            ).withName("$anon$0")
        ).withName("AccessLocation")
    ).withName("_CERT_ACCESS_DESCRIPTION");
    static final VarHandle const$4 = constants$2037.const$3.varHandle(MemoryLayout.PathElement.groupElement("pszAccessMethod"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("cAccDescr"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgAccDescr")
    ).withName("_CERT_AUTHORITY_INFO_ACCESS");
}


