// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2928 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2928() {}
    static final VarHandle const$0 = constants$2927.const$4.varHandle(MemoryLayout.PathElement.groupElement("pSchema"));
    static final StructLayout const$1 = MemoryLayout.structLayout(
        JAVA_INT.withName("Version"),
        JAVA_INT.withName("Flags"),
        JAVA_INT.withName("Count"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.sequenceLayout(1, MemoryLayout.structLayout(
            JAVA_INT.withName("dwReqNumber"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pSchema"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("dwBidiType"),
                MemoryLayout.paddingLayout(4),
                MemoryLayout.unionLayout(
                    JAVA_INT.withName("bData"),
                    JAVA_INT.withName("iData"),
                    RuntimeHelper.POINTER.withName("sData"),
                    JAVA_FLOAT.withName("fData"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cbBuf"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pData")
                    ).withName("biData")
                ).withName("u")
            ).withName("data")
        ).withName("_BIDI_REQUEST_DATA")).withName("aData")
    ).withName("_BIDI_REQUEST_CONTAINER");
    static final VarHandle const$2 = constants$2928.const$1.varHandle(MemoryLayout.PathElement.groupElement("Version"));
    static final VarHandle const$3 = constants$2928.const$1.varHandle(MemoryLayout.PathElement.groupElement("Flags"));
    static final VarHandle const$4 = constants$2928.const$1.varHandle(MemoryLayout.PathElement.groupElement("Count"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwResult"),
        JAVA_INT.withName("dwReqNumber"),
        RuntimeHelper.POINTER.withName("pSchema"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwBidiType"),
            MemoryLayout.paddingLayout(4),
            MemoryLayout.unionLayout(
                JAVA_INT.withName("bData"),
                JAVA_INT.withName("iData"),
                RuntimeHelper.POINTER.withName("sData"),
                JAVA_FLOAT.withName("fData"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbBuf"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pData")
                ).withName("biData")
            ).withName("u")
        ).withName("data")
    ).withName("_BIDI_RESPONSE_DATA");
}


