// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2004 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2004() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwAlgId"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pszObjId")
    ).withName("_CRYPT_OBJID_TABLE");
    static final VarHandle const$1 = constants$2004.const$0.varHandle(MemoryLayout.PathElement.groupElement("dwAlgId"));
    static final VarHandle const$2 = constants$2004.const$0.varHandle(MemoryLayout.PathElement.groupElement("pszObjId"));
    static final StructLayout const$3 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("HashAlgorithm"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("Hash")
    ).withName("_CRYPT_HASH_INFO");
    static final StructLayout const$4 = MemoryLayout.structLayout(
        RuntimeHelper.POINTER.withName("pszObjId"),
        JAVA_INT.withName("fCritical"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("Value")
    ).withName("_CERT_EXTENSION");
    static final VarHandle const$5 = constants$2004.const$4.varHandle(MemoryLayout.PathElement.groupElement("pszObjId"));
}


