// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2776 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2776() {}
    static final MethodHandle const$0 = RuntimeHelper.downcallHandle(
        "SCardUIDlgSelectCardW",
        constants$18.const$5
    );
    static final StructLayout const$1 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwStructSize"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("hwndOwner"),
        JAVA_LONG.withName("hSCardContext"),
        RuntimeHelper.POINTER.withName("lpstrGroupNames"),
        JAVA_INT.withName("nMaxGroupNames"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("lpstrCardNames"),
        JAVA_INT.withName("nMaxCardNames"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgguidInterfaces"),
        JAVA_INT.withName("cguidInterfaces"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("lpstrRdr"),
        JAVA_INT.withName("nMaxRdr"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("lpstrCard"),
        JAVA_INT.withName("nMaxCard"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("lpstrTitle"),
        JAVA_INT.withName("dwFlags"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pvUserData"),
        JAVA_INT.withName("dwShareMode"),
        JAVA_INT.withName("dwPreferredProtocols"),
        JAVA_INT.withName("dwActiveProtocol"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("lpfnConnect"),
        RuntimeHelper.POINTER.withName("lpfnCheck"),
        RuntimeHelper.POINTER.withName("lpfnDisconnect"),
        JAVA_LONG.withName("hCardHandle")
    ).withName("");
    static final VarHandle const$2 = constants$2776.const$1.varHandle(MemoryLayout.PathElement.groupElement("dwStructSize"));
    static final VarHandle const$3 = constants$2776.const$1.varHandle(MemoryLayout.PathElement.groupElement("hwndOwner"));
    static final VarHandle const$4 = constants$2776.const$1.varHandle(MemoryLayout.PathElement.groupElement("hSCardContext"));
    static final VarHandle const$5 = constants$2776.const$1.varHandle(MemoryLayout.PathElement.groupElement("lpstrGroupNames"));
}


