// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2084 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2084() {}
    static final VarHandle const$0 = constants$2083.const$1.varHandle(MemoryLayout.PathElement.groupElement("rgpRecipients"));
    static final StructLayout const$1 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("KeyEncryptionAlgorithm"),
        RuntimeHelper.POINTER.withName("pvKeyEncryptionAuxInfo"),
        JAVA_LONG.withName("hCryptProv"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData"),
            JAVA_INT.withName("cUnusedBits"),
            MemoryLayout.paddingLayout(4)
        ).withName("RecipientPublicKey"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwIdChoice"),
            MemoryLayout.paddingLayout(4),
            MemoryLayout.unionLayout(
                MemoryLayout.structLayout(
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cbData"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pbData")
                    ).withName("Issuer"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cbData"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pbData")
                    ).withName("SerialNumber")
                ).withName("IssuerSerialNumber"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData")
                ).withName("KeyId"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData")
                ).withName("HashId")
            ).withName("$anon$0")
        ).withName("RecipientId")
    ).withName("_CMSG_KEY_TRANS_RECIPIENT_ENCODE_INFO");
    static final VarHandle const$2 = constants$2084.const$1.varHandle(MemoryLayout.PathElement.groupElement("cbSize"));
    static final VarHandle const$3 = constants$2084.const$1.varHandle(MemoryLayout.PathElement.groupElement("pvKeyEncryptionAuxInfo"));
    static final VarHandle const$4 = constants$2084.const$1.varHandle(MemoryLayout.PathElement.groupElement("hCryptProv"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData"),
            JAVA_INT.withName("cUnusedBits"),
            MemoryLayout.paddingLayout(4)
        ).withName("RecipientPublicKey"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwIdChoice"),
            MemoryLayout.paddingLayout(4),
            MemoryLayout.unionLayout(
                MemoryLayout.structLayout(
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cbData"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pbData")
                    ).withName("Issuer"),
                    MemoryLayout.structLayout(
                        JAVA_INT.withName("cbData"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("pbData")
                    ).withName("SerialNumber")
                ).withName("IssuerSerialNumber"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData")
                ).withName("KeyId"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData")
                ).withName("HashId")
            ).withName("$anon$0")
        ).withName("RecipientId"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwLowDateTime"),
            JAVA_INT.withName("dwHighDateTime")
        ).withName("Date"),
        RuntimeHelper.POINTER.withName("pOtherAttr")
    ).withName("_CMSG_RECIPIENT_ENCRYPTED_KEY_ENCODE_INFO");
}


