// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$857 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$857() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        JAVA_INT.withName("cbSize"),
        JAVA_INT.withName("ulDataFormatVersion"),
        RuntimeHelper.POINTER.withName("lpData"),
        JAVA_INT.withName("ulLength"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("lpSectionGlobalData"),
        JAVA_INT.withName("ulSectionGlobalDataLength"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("lpSectionBase"),
        JAVA_INT.withName("ulSectionTotalLength"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("hActCtx"),
        JAVA_INT.withName("ulAssemblyRosterIndex"),
        JAVA_INT.withName("ulFlags"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("lpInformation"),
            RuntimeHelper.POINTER.withName("lpSectionBase"),
            JAVA_INT.withName("ulSectionLength"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("lpSectionGlobalDataBase"),
            JAVA_INT.withName("ulSectionGlobalDataLength"),
            MemoryLayout.paddingLayout(4)
        ).withName("AssemblyMetadata")
    ).withName("tagACTCTX_SECTION_KEYED_DATA");
    static final VarHandle const$1 = constants$857.const$0.varHandle(MemoryLayout.PathElement.groupElement("cbSize"));
    static final VarHandle const$2 = constants$857.const$0.varHandle(MemoryLayout.PathElement.groupElement("ulDataFormatVersion"));
    static final VarHandle const$3 = constants$857.const$0.varHandle(MemoryLayout.PathElement.groupElement("lpData"));
    static final VarHandle const$4 = constants$857.const$0.varHandle(MemoryLayout.PathElement.groupElement("ulLength"));
    static final VarHandle const$5 = constants$857.const$0.varHandle(MemoryLayout.PathElement.groupElement("lpSectionGlobalData"));
}


