// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2068 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2068() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwStatus"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("pszObjId"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("Value")
    ).withName("_OCSP_RESPONSE_INFO");
    static final VarHandle const$1 = constants$2068.const$0.varHandle(MemoryLayout.PathElement.groupElement("dwStatus"));
    static final VarHandle const$2 = constants$2068.const$0.varHandle(MemoryLayout.PathElement.groupElement("pszObjId"));
    static final StructLayout const$3 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("ToBeSigned"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                RuntimeHelper.POINTER.withName("pszObjId"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("cbData"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("pbData")
                ).withName("Parameters")
            ).withName("SignatureAlgorithm"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData"),
                JAVA_INT.withName("cUnusedBits"),
                MemoryLayout.paddingLayout(4)
            ).withName("Signature"),
            JAVA_INT.withName("cCertEncoded"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("rgCertEncoded")
        ).withName("SignatureInfo")
    ).withName("_OCSP_BASIC_SIGNED_RESPONSE_INFO");
    static final StructLayout const$4 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwLowDateTime"),
            JAVA_INT.withName("dwHighDateTime")
        ).withName("RevocationDate"),
        JAVA_INT.withName("dwCrlReasonCode")
    ).withName("_OCSP_BASIC_REVOKED_INFO");
    static final VarHandle const$5 = constants$2068.const$4.varHandle(MemoryLayout.PathElement.groupElement("dwCrlReasonCode"));
}


