// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2018 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2018() {}
    static final VarHandle const$0 = constants$2017.const$4.varHandle(MemoryLayout.PathElement.groupElement("rgAttribute"));
    static final StructLayout const$1 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwVersion"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cUsageIdentifier"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("rgpszUsageIdentifier")
        ).withName("SubjectUsage"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("ListIdentifier"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("SequenceNumber"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwLowDateTime"),
            JAVA_INT.withName("dwHighDateTime")
        ).withName("ThisUpdate"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwLowDateTime"),
            JAVA_INT.withName("dwHighDateTime")
        ).withName("NextUpdate"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("SubjectAlgorithm"),
        JAVA_INT.withName("cCTLEntry"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgCTLEntry"),
        JAVA_INT.withName("cExtension"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rgExtension")
    ).withName("_CTL_INFO");
    static final VarHandle const$2 = constants$2018.const$1.varHandle(MemoryLayout.PathElement.groupElement("dwVersion"));
    static final VarHandle const$3 = constants$2018.const$1.varHandle(MemoryLayout.PathElement.groupElement("cCTLEntry"));
    static final VarHandle const$4 = constants$2018.const$1.varHandle(MemoryLayout.PathElement.groupElement("rgCTLEntry"));
    static final VarHandle const$5 = constants$2018.const$1.varHandle(MemoryLayout.PathElement.groupElement("cExtension"));
}


