// Generated by jextract

package com.twitter.teruteru128.preview.windows;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2097 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2097() {}
    static final VarHandle const$0 = constants$2096.const$2.varHandle(MemoryLayout.PathElement.groupElement("rgpRecipientEncryptedKeys"));
    static final StructLayout const$1 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwVersion"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("KeyId"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("cbData"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("KeyEncryptionAlgorithm"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("cbData"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("pbData")
        ).withName("EncryptedKey"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("dwLowDateTime"),
            JAVA_INT.withName("dwHighDateTime")
        ).withName("Date"),
        RuntimeHelper.POINTER.withName("pOtherAttr")
    ).withName("_CMSG_MAIL_LIST_RECIPIENT_INFO");
    static final VarHandle const$2 = constants$2097.const$1.varHandle(MemoryLayout.PathElement.groupElement("dwVersion"));
    static final VarHandle const$3 = constants$2097.const$1.varHandle(MemoryLayout.PathElement.groupElement("pOtherAttr"));
    static final StructLayout const$4 = MemoryLayout.structLayout(
        JAVA_INT.withName("dwRecipientChoice"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.unionLayout(
            RuntimeHelper.POINTER.withName("pKeyTrans"),
            RuntimeHelper.POINTER.withName("pKeyAgree"),
            RuntimeHelper.POINTER.withName("pMailList")
        ).withName("$anon$0")
    ).withName("_CMSG_CMS_RECIPIENT_INFO");
    static final VarHandle const$5 = constants$2097.const$4.varHandle(MemoryLayout.PathElement.groupElement("dwRecipientChoice"));
}


